[
  {
    "title": "Dick and Jane: Fun with Dick and Jane",
    "authors": [
      "Penguin Young Readers"
    ],
    "published_year": "2004",
    "publisher": "Penguin",
    "description": "\"Look, Jane, \" said Dick. \"Here is something funny. Can you guess what it is?\""
  },
  {
    "title": "100 Must-read Classic Novels",
    "authors": [
      "Nick Rennison"
    ],
    "published_year": "2006",
    "publisher": "A&amp;C Black",
    "description": "Want to become a classic novel buff, or expand your reading of some of the finest novels ever published? With 100 of the best titles fully reviewed and a further 500 recommended, you'll quickly set out on a journey of discovery."
  },
  {
    "title": "The Rough Guide to Classic Novels",
    "authors": [
      "Simon Mason"
    ],
    "published_year": "2008",
    "publisher": "Penguin",
    "description": "Get the lowdown on the best fiction ever written. Over 230 of the world's greatest novels are covered, from Quixote (1614) to Orhan Pamuk's Snow (2002), with fascinating information about their plots and their authors - and suggestions for what to read next. The guide comes complete with recommendations of the best editions and translations for every genre from the most enticing crime and punishment to love, sex, heroes and anti-heroes, not to mention all the classics of comedy and satire, horror and mystery and many other literary genres. With feature boxes on experimental novels, female novelists, short reviews of interesting film and TV adaptations, and information on how the novel began, this guide will point you to all the classic literature you'll ever need."
  },
  {
    "title": "Three Classic Novels",
    "authors": [
      "Erskine Caldwell"
    ],
    "published_year": "2017",
    "publisher": "Open Road Media",
    "description": "Three powerful novels of racism, lust, and poverty in the rural South by a controversial national bestselling author. Bigotry, poverty, social injustice, and sexual squalor in the Deep South—hallmarks of one of the most daring and phenomenally popular bestselling novelists of the twentieth-century. Here, in one volume, are three of his best-known works. “None of [his] characters would be caught dead in a novel by John Steinbeck, Carson McCullers, or Eudora Welty” (The Daily Beast). Tobacco Road: The Great Depression compromises the morals of a poor farming family in Georgia. This classic, a Modern Library 100 Best Novels selection, was adapted for the stage in 1933 and made into a 1941 film directed by John Ford. God’s Little Acre: Desperation takes its toll on a deluded Southern farmer obsessed with sex, violence, and the promise of gold. Banned in Boston, censored in Georgia, and prosecuted by the New York Society for the Suppression of Vice, this international bestseller was adapted into a film in 1958. A Place Called Estherville: In the pre-civil-rights-era South, a biracial brother and sister move to a small segregated town to care for their aunt, only to be subjected to systematic racism, sexual violence, and prejudice. “What William Faulkner implies, Erskine Caldwell records,” said the Chicago Tribune of the author who earned his reputation by writing about sex, racism, and religious hypocrisy when no one else was. Caldwell remains one of the most widely translated American authors of all time. This ebook features an illustrated biography of Erskine Caldwell including rare photos and never-before-seen documents courtesy of the Dartmouth College Library."
  },
  {
    "title": "Four Classic Novels",
    "authors": [
      "Jane Austen"
    ],
    "published_year": "2012",
    "publisher": "Barnes & Noble Incorporated",
    "description": "Elegant, sophisticated and full of humour and romance, the novels of Jane Austen have been favourites of readers around the world for more than two centuries. Although set at the turn of the nineteenth century, in the England that she herself knew, Austen's characters espouse values and sentiments that still speak to modern sensibilities. No author has captured so vividly the affairs of hearts in conflict with class and social convention. This volume features four of Jane Austen's best-loved works: Sense and Sensibility, Pride and Prejudice, Emma and Persuasion."
  },
  {
    "title": "A Very Bad Wizard",
    "authors": [
      "Tamler Sommers"
    ],
    "published_year": "2016",
    "publisher": "Routledge",
    "description": "In the first edition of A Very Bad Wizard: Morality Behind the Curtain – Nine Conversations, philosopher Tamler Sommers talked with an interdisciplinary group of the world’s leading researchers—from the fields of social psychology, moral philosophy, cognitive science, and primatology—all working on the same issue: the origins and workings of morality. Together, these nine interviews pulled back some of the curtain, not only on our moral lives but—through Sommers’ probing, entertaining, and well informed questions—on the way morality traditionally has been studied. This Second Edition increases the subject matter, adding eight additional interviews and offering features that will make A Very Bad Wizard more useful in undergraduate classrooms. These features include structuring all chapters around sections and themes familiar in a course in ethics or moral psychology; providing follow-up podcasts for some of the interviews, which will delve into certain issues from the conversations in a more informal manner; including an expanded and annotated reading list with relevant primary sources at the end of each interview; presenting instructor and student resources online in a companion website. The resulting new publication promises to synthesize and make accessible the latest interdisciplinary research to offer a brand new way to teach philosophical ethics and moral psychology."
  },
  {
    "title": "The Catcher in the Rye",
    "authors": [
      "J. D. Salinger"
    ],
    "published_year": "2024",
    "publisher": "ببلومانيا للنشر والتوزيع",
    "description": "The Catcher in the Rye,&quot; written by J.D. Salinger and published in 1951, is a classic American novel that explores the themes of adolescence, alienation, and identity through the eyes of its protagonist, Holden Caulfield. The novel is set in the 1950s and follows Holden, a 16-year-old who has just been expelled from his prep school, Pencey Prep. Disillusioned with the world around him, Holden decides to leave Pencey early and spend a few days alone in New York City before returning home. Over the course of these days, Holden interacts with various people, including old friends, a former teacher, and strangers, all the while grappling with his feelings of loneliness and dissatisfaction. Holden is deeply troubled by the &quot;phoniness&quot; of the adult world and is haunted by the death of his younger brother, Allie, which has left a lasting impact on him. He fantasizes about being &quot;the catcher in the rye,&quot; a guardian who saves children from losing their innocence by catching them before they fall off a cliff into adulthooda. The novel ends with Holden in a mental institution, where he is being treated for a nervous breakdown. He expresses some hope for the future, indicating a possible path to recovery.."
  },
  {
    "title": "Passing",
    "authors": [
      "Nella Larsen"
    ],
    "published_year": "2022",
    "publisher": "Alien Ebooks",
    "description": "Harlem Renaissance author Nella Larsen (1891 –1964) published just two novels and three short stories in her lifetime, but achieved lasting literary acclaim. Her classic novel Passing first appeared in 1926."
  },
  {
    "title": "Discoveries",
    "authors": [
      "Wendy Body"
    ],
    "published_year": "1999",
    "publisher": "Longman",
    "description": "Part of the Pelican Big Books series, this anthology's teaching focus is on exploring language use and themes, and discussing reasons for the lasting appeal of such classics. The series has been specifically written for the shared reading part of the literacy hour and supports the genre requirements of the National Literacy Strategy."
  },
  {
    "title": "Classic",
    "authors": [
      "Cecily Von Ziegesar"
    ],
    "published_year": "2014",
    "publisher": "Poppy Books",
    "description": "Jenny Humphrey wants to be the best at Waverly Academy."
  },
  {
    "title": "American Science Fiction: Four Classic Novels 1960-1966 (LOA #321)",
    "authors": [
      "Poul Anderson",
      "Clifford D. Simak",
      "Daniel Keyes",
      "Roger Zelasny"
    ],
    "published_year": "2019",
    "publisher": "Library of America",
    "description": "In a deluxe collector's edition hardcover, four classic novels from science fiction's most transformative decade, including the landmark Flowers for Algernon This volume, the first of a two-volume set gathering the best American science fiction from the tumultuous 1960s, opens with Poul Anderson's immensely popular The High Crusade, in which aliens planning to conquer Earth land in Lincolnshire during the Hundred Years' War. In Clifford Simak's Hugo Award-winning Way Station, Enoch Wallace is a spry 124-year-old Civil War veteran whose lifelong job monitoring the intergalactic pit stop inside his home is largely uneventful--until a CIA agent shows up and Cold War hostilities threaten the peaceful harmony of the Galactic confederation. Daniel Keyes's beloved Flowers for Algernon, winner of the Nebula Award and adapted as the Academy Award-winning movie Charly, is told through the journal entries of Charlie Gordon, a young man with severe learning disabilities who is the test subject for surgery to improve his intelligence. And in the postapocalyptic earthscape of Roger Zelazny's Hugo Award-winning . . . And Call Me Conrad (also published as This Immortal) Conrad Nomikos reluctantly accepts the responsibility of showing the planet to the governing extraterrestrials' representative and protecting him from rebellious remnants of the human race. Using early manuscripts and original setting copy, this Library of America volume restores the novel to a version that most closely approximates Zelazny's original text."
  },
  {
    "title": "Four Great American Classics",
    "authors": [
      "Herman Melville",
      "Mark Twain",
      "Stephen Crane"
    ],
    "published_year": "2008",
    "publisher": "Bantam Classics",
    "description": "These four landmark novels of nineteenth-century American literature have gained a permanent place in our culture as great classics. They are not only part of our national heritage, but masterpieces of world literature whose deep and lasting influence is felt to this day. The Scarlet Letter vividly records America’s moral and historical roots in Puritan New England and masterfully re-creates a society’s preoccupation with sin, guilt, and pride. The Adventures of Huckleberry Finn carries readers along on Huck’s unforgettable journey down the Mississippi in America’s foremost comic epic—the first great novel in a truly American voice. The Red Badge of Courage re-creates the brutal reality of war and its psychological impact on a young Civil War soldier in one of the most moving and widely read American novels. Billy Budd, Sailor, and Other Stories joins the world’s great tragic literature as a doomed seaman becomes the innocent victim of a clash between social authority and individual freedom."
  },
  {
    "title": "The Pleasures of Reading in an Age of Distraction",
    "authors": [
      "Alan Jacobs"
    ],
    "published_year": "2011",
    "publisher": "Oxford University Press",
    "description": "In recent years, cultural commentators have sounded the alarm about the dire state of reading in America. Americans are not reading enough, they say, or reading the right books, in the right way. In this book, Alan Jacobs argues that, contrary to the doomsayers, reading is alive and well in America. There are millions of devoted readers supporting hundreds of enormous bookstores and online booksellers. Oprah's Book Club is hugely influential, and a recent NEA survey reveals an actual uptick in the reading of literary fiction. Jacobs's interactions with his students and the readers of his own books, however, suggest that many readers lack confidence; they wonder whether they are reading well, with proper focus and attentiveness, with due discretion and discernment. Many have absorbed the puritanical message that reading is, first and foremost, good for you--the intellectual equivalent of eating your Brussels sprouts. For such people, indeed for all readers, Jacobs offers some simple, powerful, and much needed advice: read at whim, read what gives you delight, and do so without shame, whether it be Stephen King or the King James Version of the Bible. In contrast to the more methodical approach of Mortimer Adler's classic How to Read a Book (1940), Jacobs offers an insightful, accessible, and playfully irreverent guide for aspiring readers. Each chapter focuses on one aspect of approaching literary fiction, poetry, or nonfiction, and the book explores everything from the invention of silent reading, reading responsively, rereading, and reading on electronic devices. Invitingly written, with equal measures of wit and erudition, The Pleasures of Reading in an Age of Distraction will appeal to all readers, whether they be novices looking for direction or old hands seeking to recapture the pleasures of reading they first experienced as children."
  },
  {
    "title": "The Secret Sharer",
    "authors": [
      "Joseph Conrad"
    ],
    "published_year": "2024",
    "publisher": "Modernista",
    "description": "»The Secret Sharer« is a short story by Joseph Conrad, originally published in 1910. JOSEPH CONRAD [1857–1924] was born in Ukraine to Polish parents, went to sea at the age of seventeen, and ended his career as a captain in the English merchant navy. His most famous work is the novella Heart of Darkness [1899], adapted into a film by Francis Ford Coppola in 1979 as Apocalypse Now."
  },
  {
    "title": "American Classics (Omnibus Edition) (Diversion Classics)",
    "authors": [
      "Nathaniel Hawthorne",
      "Herman Melville",
      "Washington Irving",
      "James Fenimore Cooper",
      "Jack London"
    ],
    "published_year": "2015",
    "publisher": "Diversion Books",
    "description": "Featuring an appendix of discussion questions, the Diversion Classics edition is ideal for use in book groups and classrooms. In this collection of classics, five seminal tales come together to form a picture of America in its youth, but on the cusp of growing up. These stories defined and challenged the standards of American literature, and their influence is immeasurable. Including Nathaniel Hawthorne's THE SCARLET LETTER, Herman Melville's MOBY DICK, James Fenimore Cooper's THE LAST OF THE MOHICANS, Washington Irving's THE LEGEND OF SLEEPY HOLLOW, and Jack London's THE CALL OF THE WILD, this anthology edition is perfect for the voracious reader."
  },
  {
    "title": "The Time Machine illustrated",
    "authors": [
      "H. G. Wells"
    ],
    "published_year": "2022",
    "publisher": "BoD - Books on Demand",
    "description": "The Time Machine by H. G. Wells is a science fiction classic, which lends itself well to visualization. This version, illustrated by Yoann Laurent-Rouault, an illustrator master who graduated from the Beaux-Arts, and published in the international literary collection Memoria Books, is a reference on the time travel theme. Wells transports us in the year 802 701, in a society made up of the “Elois”, who live peacefully in a kind of big Garden of Eden, eating fruits and sleeping high up, while underground lives another species, also descending from men, the “Morlocks”, who do not stand the light anymore, living in the dark for too long now. At night, they return to the surface, going back up by the wells, in order to kidnap some Elois that they eat ; these last became livestock unknowingly. In The Time Machine, made into a movie several times, the last of them in 2002 by Simon Wells, the great-grandson of H. G. Wells, time is both a pretext to move the class struggle and warn... and also, in a way, a full character, who fascinates, arbitrates, transcends... The illustrations come to reinforce the time travel and provide a new experience to the reader."
  },
  {
    "title": "A Thousand of the Best Novels (Classic Reprint)",
    "authors": [
      "Newark Free Public Library"
    ],
    "published_year": "2018",
    "publisher": "Forgotten Books",
    "description": "Excerpt from A Thousand of the Best Novels If printing was a happy thought and books are not a curse, then novels must be praised. They belong, with the dramas and the poems, among the good things which make our heritage; which unite men by community of thought and feeling; which make it a joy to have the art of reading; and give us simple pleasures, strong emotions, knowledge of our fellows, and sym pathy with all mankind. One may live well and be happy and read no stories; but most are wiser, happier and worth more to their fellows for the novels they have read. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works."
  },
  {
    "title": "Kidnapped",
    "authors": [
      "Robert Louis Stevenson"
    ],
    "published_year": "1886",
    "publisher": "Cosimo Classics",
    "description": "\"There are two things that men should never weary of, goodness and humility; we get none too much of them in this rough world among cold, proud people. - Robert Louis Stevenson, Kidnapped Kidnapped (1886) by Robert Louis Stevenson is a coming-of-age novel that recounts the adventures of a teenager named David Balfour during the Jacobite Rebellions in 18th century Scotland. Following his father's death, David reaches out to an uncle, who betrays his nephew and sells him to a slave-trader headed for America. David's rescue from the slave ship by a Jacobite refugee starts David on a series of adventures that ensure his passage into manhood."
  },
  {
    "title": "A Tale of Two Cities + Great Expectations",
    "authors": [
      "Charles Dickens"
    ],
    "published_year": "2022",
    "publisher": "DigiCat",
    "description": "A Tale of Two Cities and Great Expectations are two most beloved novels by Charles Dickens. Tale of Two Cities is is a novel set in London and Paris before and during the French Revolution. The main characters — Doctor Alexandre Manette, Charles Darnay, and Sydney Carton — are all recalled to life, or resurrected, in different ways as turmoil erupts. Great Expectations centers around a poor young man by the name of Pip, who is given the chance to make himself a gentleman by a mysterious benefactor. Great Expectations offers a fascinating view of the differences between classes during the Victorian era, as well as a great sense of comedy and pathos. Charles John Huffam Dickens ( 1812 – 1870) was an English writer and social critic. He created some of the world's most memorable fictional characters and is generally regarded as the greatest novelist of the Victorian period. During his life, his works enjoyed unprecedented fame, and by the twentieth century his literary genius was broadly acknowledged by critics and scholars. His novels and short stories continue to be widely popular."
  },
  {
    "title": "A Treasury of Children's Literature",
    "authors": [
      "Armand Eisen"
    ],
    "published_year": "1992",
    "publisher": "Houghton Mifflin Harcourt",
    "description": "A collection of traditional and original stories and poems by such authors as Aesop and Lewis Carroll, including excerpts from \"The Wind in the Willows\" and \"Peter Pan.\""
  },
  {
    "title": "The Smitten Kitchen Cookbook",
    "authors": [
      "Deb Perelman"
    ],
    "published_year": "2012",
    "publisher": "Knopf",
    "description": "NEW YORK TIMES BEST SELLER • Celebrated food blogger and best-selling cookbook author Deb Perelman knows just the thing for a Tuesday night, or your most special occasion—from salads and slaws that make perfect side dishes (or a full meal) to savory tarts and galettes; from Mushroom Bourguignon to Chocolate Hazelnut Crepe. “Innovative, creative, and effortlessly funny.\" —Cooking Light Deb Perelman loves to cook. She isn’t a chef or a restaurant owner—she’s never even waitressed. Cooking in her tiny Manhattan kitchen was, at least at first, for special occasions—and, too often, an unnecessarily daunting venture. Deb found herself overwhelmed by the number of recipes available to her. Have you ever searched for the perfect birthday cake on Google? You’ll get more than three million results. Where do you start? What if you pick a recipe that’s downright bad? With the same warmth, candor, and can-do spirit her award-winning blog, Smitten Kitchen, is known for, here Deb presents more than 100 recipes—almost entirely new, plus a few favorites from the site—that guarantee delicious results every time. Gorgeously illustrated with hundreds of her beautiful color photographs, The Smitten Kitchen Cookbook is all about approachable, uncompromised home cooking. Here you’ll find better uses for your favorite vegetables: asparagus blanketing a pizza; ratatouille dressing up a sandwich; cauliflower masquerading as pesto. These are recipes you’ll bookmark and use so often they become your own, recipes you’ll slip to a friend who wants to impress her new in-laws, and recipes with simple ingredients that yield amazing results in a minimum amount of time. Deb tells you her favorite summer cocktail; how to lose your fear of cooking for a crowd; and the essential items you need for your own kitchen. From salads and slaws that make perfect side dishes (or a full meal) to savory tarts and galettes; from Mushroom Bourguignon to Chocolate Hazelnut Crepe Cake, Deb knows just the thing for a Tuesday night, or your most special occasion. Look for Deb Perelman’s latest cookbook, Smitten Kitchen Keepers!"
  },
  {
    "title": "The Wonderland Collection (Seasons Edition -- Summer)",
    "authors": [
      "Lewis Carroll"
    ],
    "published_year": "2020",
    "publisher": "Thomas Nelson",
    "description": "A fine exclusive edition of one of literature’s most beloved stories with full page call-outs with quotes from summer. So she was considering in her own mind (as well as she could, for the hot day made her feel very sleepy and stupid), whether the pleasure of making a daisy-chain would be worth the trouble of getting up and picking the daisies, when suddenly a White Rabbit with pink eyes ran close to her. Lewis Carroll’s Alice in Wonderland books have delighted readers across the globe for more than a hundred years. The Wonderland Collection presents three of Carroll's most famous works: Alice in Wonderland Through the Looking Glass A Tangled Tale The Wonderland Collection (Seasons Edition--Summer) is one of four titles available in June 2020. The summer season also will include Jane Eyre, Persuasion, and the Adventures of Huckleberry Finn."
  },
  {
    "title": "Greek Tragedy",
    "authors": [
      "H. D. F. Kitto"
    ],
    "published_year": "2002",
    "publisher": "Routledge",
    "description": "Neither a history nor a handbook, but a penetrating work of criticism, this classic text not only records developments in the form and style of Greek drama, it also analyses the reasons for these changes."
  },
  {
    "title": "Eighty Days",
    "authors": [
      "Matthew Goodman"
    ],
    "published_year": "2013",
    "publisher": "Random House Digital, Inc.",
    "description": "Documents the 1889 competition between feminist journalist Nellie Bly and Cosmopolitan reporter Elizabeth Bishop to beat Jules Verne's record and each other in a round-the-globe race, offering insight into their respective daunting challenges as recorded in their reports sent back home. 50,000 first printing."
  },
  {
    "title": "Nine of the Best Classic Novels in History",
    "authors": [
      "Watkins Publications"
    ],
    "published_year": "2017",
    "publisher": "Createspace Independent Publishing Platform",
    "description": "This is a collection of nine familiar and best seller novels in history from nine great authors The Hound of the Baskervilles: The Hound of the Baskervilles is the third of the crime novels written by Sir Arthur Conan Doyle featuring the detective Sherlock Holmes The Great Gatsby: The Great Gatsby is a novel by the American author F. Scott Fitzgerald. First published on April 10, 1925, it is set in Long Island's North Shore and New York City during the summer of 1922 Mrs Dalloway: Mrs Dalloway is a novel by Virginia Woolf that details a day in the life of Clarissa Dalloway, a fictional high-society woman in post-First World War England. It is one of Woolf's best-known novels This volume contains: Heart of Darkness: Heart of Darkness is a novella written by Polish-born writer Joseph Conrad. Before its 1902 publication, it appeared as a three-part series (1899) in Blackwood's Magazine. It is widely regarded as a significant work of English literature and part of the Western canon Frankenstein: Frankenstein; or, The Modern Prometheus, generally known as Frankenstein, is a novel written by the British author Mary Shelley. The title of the novel refers to a scientist, Victor Frankenstein, who learns how to create life and creates a being in the likeness of man, but larger than average and more powerful"
  },
  {
    "title": "Stoner",
    "authors": [
      "John Williams"
    ],
    "published_year": "2015",
    "publisher": "New York Review of Books",
    "description": "\"Born the child of a poor farmer in Missouri, William Stoner is urged by his parents to study new agriculture techniques at the state university. Digging instead into the texts of Milton and Shakespeare, Stoner falls under the spell of the unexpected pleasures of English literature, and decides to make it his life. Stoner is the story of that life\"--"
  },
  {
    "title": "A Tale of Two Cities (Artisan Edition)",
    "authors": [
      "Charles. Dickens"
    ],
    "published_year": "2024",
    "publisher": "Harper Muse",
    "description": "The beloved historical novel is now available in an affordable softcover edition featuring a striking cover and distinctive interior design elements, making it ideal for lovers of classic fiction, readers in high-school and college literature courses, and fans of annual reading challenges and \"Required Reading\" lists. The A Tale of Two Cities softcover edition: Presents Charles Dickens's famed historical novel set during the French Revolution, regarded by many literary scholars as one of the bestselling novels of all time; its 1859 publication helped secure Dickens's place in literature's pantheon of great writers. Explores such important themes as violence, duality, resurrection, revolution, and the significance of women's roles in social change. Is ideal for Dickens aficionados, fans of literary fiction and classic literature, and people who love both the book and the cinematic adaptations it inspired. Whether you're buying this as a gift or as a self-purchase, this remarkable edition features: Beautiful softcover Distinctive decorative interior pages featuring pull quotes distributed throughout Part of a 4-volume collection including Jane Austen's Pride and Prejudice, Louisa May Alcott's Little Women, and Emily Brontë's Wuthering Heights. After eighteen years as a political prisoner in the Bastille, the aging Dr. Manette is finally released and reunited with his daughter Lucie in London. However, there he meets two very different men, connected through their love for Lucie Manette. Drawn against their will to Paris at the height of the French Revolution's Reign of Terror, they all soon fall under the lethal, far-reaching shadow of \"La Guillotine.\" An affordable edition ideal for your favorite classic fiction lover, literature student, or fan of annual reading challenges."
  },
  {
    "title": "The Modern Library",
    "authors": [
      "Carmen Callil",
      "Colm Toibin"
    ],
    "published_year": "2011",
    "publisher": "Hachette UK",
    "description": "For Colm Toíbín and Carmen Callil there is no difference between literary and commercial writing - there is only the good novel: engrossing, inspirational, compelling. In their selection of the best 200 novels written since 1950, the editors make a case for the best and the best-loved works and argue why each should be considered a modern classic. Enlightening, often unexpected and always engaging this tour through the world of fiction is full of surprises, forgotten masterpieces and a valuable guide to what to read next. Authors in the collection include Agatha Christie, Georgette Heyer, Daphne du Maurier, Patrick Hamilton, Carson McCullers, J. D. Salinger, Bernard Malamud; Flannery O'Connor, Mulk Raj Anand, Raymond Chandler, L. P. Hartley, Amos Tutuola, Sylvia Townsend Warner, Samuel Beckett, Patricia Highsmith, Chinua Achebe, Isak Dineson, Alan Sillitoe, Ivy Compton-Burnett, Grace Paley, Harper Lee, Olivia Manning and Mordecai Richler."
  },
  {
    "title": "Lord of the Flies",
    "authors": [
      "William Golding"
    ],
    "published_year": "2012",
    "publisher": "Faber & Faber",
    "description": "A plane crashes on a desert island and the only survivors, a group of schoolboys, assemble on the beach and wait to be rescued. By day they inhabit a land of bright fantastic birds and dark blue seas, but at night their dreams are haunted by the image of a terrifying beast. As the boys' delicate sense of order fades, so their childish dreams are transformed into something more primitive, and their behaviour starts to take on a murderous, savage significance. First published in 1954, Lord of the Flies is one of the most celebrated and widely read of modern classics. Now fully revised and updated, this educational edition includes chapter summaries, comprehension questions, discussion points, classroom activities, a biographical profile of Golding, historical context relevant to the novel and an essay on Lord of the Flies by William Golding entitled 'Fable'. Aimed at Key Stage 3 and 4 students, it also includes a section on literary theory for advanced or A-level students. The educational edition encourages original and independent thinking while guiding the student through the text - ideal for use in the classroom and at home."
  },
  {
    "title": "Classic Novel Collections",
    "authors": [
      "Classic Novel Collections"
    ],
    "published_year": "2015",
    "publisher": "CreateSpace",
    "description": "The perfect gift for readers of all ages! At Classic Novel Collections, we believe nothing can replace the magic of receiving a physical book as a gift (either for a friend or yourself!) Each of our collections features several timeless classics grouped together into one knowledge-packed offering. Take a step back from today's fast-paced world and sit down with some of the greatest writers and thinkers in history! This collection includes: The Last of the Mohicans by James Fenimore Cooper, The Lone Star Ranger by Zane Grey, and The Red Badge of Courage by Stephen Crane."
  },
  {
    "title": "The List of 7",
    "authors": [
      "Mark Frost"
    ],
    "published_year": "2011",
    "publisher": "Harper Collins",
    "description": "Dark Brotherhood As the city of London slumbers, there are those in its midst who conspire to rule the world through the darkest and most nefarious means. These seven, seated in positions of extraordinary power and influence, marshal forces from the far side to aid them in their fiendish endeavor. Force of One In the aftermath of a bloody séance and a terrifying supernatural contact, a courageous young doctor finds himself drawn into a malevolent conspiracy beyond human comprehension. All or Nothing The future is not safe, as a thousand-year reign of pure evil is about to begin, unless a small group of stalwart champions can unravel the unspeakable mysteries behind a crime far more terrible than murder."
  },
  {
    "title": "Ignite Me",
    "authors": [
      "Tahereh Mafi"
    ],
    "published_year": "2014",
    "publisher": "Harper Collins",
    "description": "The heart-stopping third installment in the New York Times bestselling Shatter Me series, which Ransom Riggs, author of Miss Peregrine's Home for Peculiar Children and Hollow City, called \"a thrilling, high-stakes saga of self-discovery and forbidden love.\" With Omega Point destroyed, Juliette doesn't know if the rebels, her friends, or even Adam are alive. But that won't keep her from trying to take down The Reestablishment once and for all. Now she must rely on Warner, the handsome commander of Sector 45. The one person she never thought she could trust. The same person who saved her life. He promises to help Juliette master her powers and save their dying world . . . but that's not all he wants with her. The Shatter Me series is perfect for fans who crave action-packed young adult novels with tantalizing romance like Divergent by Veronica Roth, The Hunger Games by Suzanne Collins, and Legend by Marie Lu. Tahereh Mafi has created a captivating and original story that combines the best of dystopian and paranormal and was praised by Publishers Weekly as \"a gripping read from an author who's not afraid to take risks.\" Don’t miss Defy Me, the shocking fifth book in the Shatter Me series!"
  },
  {
    "title": "The Wild",
    "authors": [
      "K. Webster"
    ],
    "published_year": "2017",
    "publisher": "Createspace Independent Publishing Platform",
    "description": "I brought them to the wilderness because we couldn't cope with our reality. The plan was to make a new life that didn't include heartache. No people. No technology. No interference. Just us. A chance to piece together what was broken. But the wilderness is untamed and harsh. Brutal and unforgiving. It doesn't give a damn about your feelings. Tragedy lives there too. No escaping the truths that won't let you go. All you can do is survive where love, no matter how beastly, is the only thing you can truly count on. Confusing. Wrong. Twisted. Beautiful. Sick. Love is wild. And we're going to set it free. WARNING: The Wild is an extremely taboo story. Most will find that the themes in this book will make you incredibly uncomfortable or maybe even offend you. This book is only for the brave, the open-minded, and the ones who crave love in even the most dismal of situations. Extreme sexual themes and violence in certain scenes, which could trigger emotional distress, are found in this story. If you are sensitive to heavy taboo themes, then this story is not for you. Seriously, you've been warned. Don't say I didn't try. You're probably going to cringe many, many, many times. Even if you're on the fence, it's probably not a good idea to proceed. However, if you're intrigued and fearless and kind of sort of trust me, then carry on. This book is for you."
  },
  {
    "title": "The Jinni Key",
    "authors": [
      "Bethany Atazadeh"
    ],
    "published_year": "2019",
    "publisher": "Grace House Press",
    "description": "She holds the key to his heart, and he wants it back. When Arie reveals her Gift, she thinks the worst is over. But she couldn't be more wrong. The only one who can save her now is a mermaid named Rena. Rena is the youngest daughter of the Sea King, and she's dreamed of the surface for years. But her first visit on her 16th birthday isn't what she expects. She watches a Jinni fall from the sky—and chooses to save him, despite her mother's warnings that all Jinn are evil. Once she meets Gideon, she can't get him out of her mind. And maybe, with a little help from Arie and some magic of her own, she doesn't have to... The Jinni Key is a loose \"Little Mermaid\" retelling. Set in a world that humans share with mermaids, dragons, and the elusive Jinn, this is not the fairytale you remember… If you enjoy fantasy worlds, magical races, and surprising spins on classic fairy tales, then you'll love this enchanting retelling of The Little Mermaid. WHAT READERS ARE SAYING: \"There was very little that I predicted, when there was a moment of loss I truly felt it, and I loved the unique spins she placed on the well-known THE LITTLE MERMAID tale.\" Rachael Martin (Goodreads Reviewer) \"I went into this story super excited to find out more about Rena and Arie, and I was left unable to wait for the next book! I seriously read this book in one sitting (which left everything aching, but so worth it!). I absolutely loved The Stolen Kingdom, and book two did not disappoint. The Jinni Key's world-building was actually one of my favorites, so complex and detailed and very fun.\" Sarah Sutton (Goodreads Reviewer) \"I couldn't even put the book down because I had to know what happened... These are the kind of retellings that I love because while the base story is weaved in there lightly the story doesn't rely on The Little Mermaid. It goes so far past that and you are invested in everything that is happening…\" Katelyn Spedden (Goodreads Reviewer) \"There is so much action going on in this book and as the story moved on, the stakes kept getting higher and higher - I couldn't put it down (read it in a few hours) and I can't wait to read the next book in the series!\" Elira Barnes (Goodreads Reviewer) \"This was an amazing second book! All of Bethany's hard work paid off ten fold! I loved how all the relationships developed and all the animal moments. I especially love Rena and her quirky personality. She makes an amazing POV character.\" Andrea Roberts (Goodreads Reviewer) \"Once again, Bethany Atazadeh takes some risks with this Little Mermaid retelling and mixes in a lot of original story and world elements, along with engaging characters to make it an intriguing and magical read that I was sad to see end.\" Janine (Goodreads Reviewer) \"I loved finding out what happens next. I'm excited and am definitely going to read the third book. Captivating story.\" Kaylee White (Goodreads Reviewer) THE STOLEN KINGDOM SERIES READING ORDER: Book 1: The Stolen Kingdom: An Aladdin retelling Book 2: The Jinni Key: A Little Mermaid retelling Book 3: The Cursed Hunter: A Beauty and the Beast retelling Book 4: The Enchanted Crown: A Sleeping Beauty retelling THE QUEEN'S RISE SERIES (a connected trilogy in The Stolen Kingdom Universe) Book 1: The Secret Gift Book 2: The Secret Shadow Book 3: The Secret Curse"
  },
  {
    "title": "The Lotus Palace",
    "authors": [
      "Jeannie Lin"
    ],
    "published_year": "2020",
    "publisher": "HQN Books",
    "description": "An unlikely pair of heroes find themselves caught in a star-crossed relationship in this rich tale of history, mystery and forbidden love! At the Lotus Palace, the best of society comes to drink and enjoy the company of beautiful and talented courtesans. Street-smart and practical Yue-ying is not part of this elite class but is content to live in the shadow of her mistress, Mingyu, only serving as her silent attendant at the lavish and exquisite palace. Running into notorious flirt Bai Huang changes everything. Bai Huang, an eternal student at the palace, is different from Yue-ying in every way. But as the two are thrown together in an attempt to solve a deadly mystery, they both start to dream of a different life. Their statuses forbid them from being together, but could they find a way to follow their hearts? Previously published."
  },
  {
    "title": "Beautiful Collision - A Single Mom Enemies to Lovers Romance Book",
    "authors": [
      "A. M. Kusi"
    ],
    "published_year": "2021",
    "publisher": "Our Peaceful Family",
    "description": "A mom on the run. A man who missed his shot. When their paths cross long after meeting, will misunderstandings lead to love? Maddy Miller is barely keeping her head above water. A struggling single mother raising a little boy, she’s terrified when her house is broken into and flees in panic to a childhood father-figure. But after she mistakenly pepper sprays the gorgeous guy who hated her in school, she wishes she’d left a better impression. Fresh out of the Navy, Turner Walker is ready for a new chapter. So when one of the mean girls he had a secret teenage crush on confuses him with an intruder in his own home, he’s immediately suspicious of her intentions with his dad. But as he grows closer to the troubled woman, he can’t ignore his old feelings… or their red-hot chemistry. Falling hard for the handsome former sailor, Maddy’s petrified her chance at happily ever after will fall victim to a shadowy stalker. And with the truth of their shared history thrown into a drastically new light, Turner won’t rest until the girl of his dreams is safe. Can long-overdue passions survive an obsessive danger from the past? Beautiful Collision is a pulse-pounding standalone romance. If you like steamy attractions, satisfying retribution, and shocking secrets, then you’ll adore A. M. Kusi’s riveting tale. Buy Beautiful Collision to crash into desire today! ***No cheating. HEA guaranteed.*** ----------- Keywords related to this contemporary romance novel: Single mom romance novel, romantic suspense, enemies to lovers romantic suspense, steamy romance, single parent romance, woman on the run romance, enemies to lovers romance, small town romance, military romance, military hero suspense, romantic suspense, contemporary romance novel, interracial romance books, new adult romance, multicultural romance books, strong female lead, biracial romance, black man romance, wwbm romance, strong women, beach reads, strong heroine, romance suspense, interracial romance books, romance ebook, IR romance books, wounded heroine romance, contemporary romance series, african american romance, ir books, stripper romance, romance novels to read, love story, love story books, abused heroine romance, interracial relationship, small town romance series, standalone romance books, interracial romance bmww, bmww, letting go of past romance, military hero, me too romance, interracial romance novels,"
  },
  {
    "title": "Romancing the Beat",
    "authors": [
      "Gwen Hayes"
    ],
    "published_year": "2016",
    "publisher": "Createspace Independent Publishing Platform",
    "description": "What makes a romance novel a romance? How do you write a kissing book?Writing a well-structured romance isn't the same as writing any other genre-something the popular novel and screenwriting guides don't address. The romance arc is made up of its own story beats, and the external plot and theme need to be braided to the romance arc-not the other way around.Told in conversational (and often irreverent) prose, Romancing the Beat can be read like you are sitting down to coffee with romance editor and author Gwen Hayes while she explains story structure. The way she does with her clients. Some of whom are regular inhabitants of the New York Times and USA Today bestseller lists.Romancing the Beat is a recipe, not a rigid system. The beats don't care if you plot or outline before you write, or if you pants your way through the drafts and do a \"beat check\" when you're revising. Pantsers and plotters are both welcome. So sit down, grab a cuppa, and let's talk about kissing books."
  },
  {
    "title": "Uncovered by Love",
    "authors": [
      "Madeline Ash"
    ],
    "published_year": "2012",
    "publisher": "Penguin Group Australia",
    "description": "Vera Cole is a passionate sculptor whose dream is to study art in Spain. But when wealthy investor Leeson Stone offers her work at his gallery, Vera's dwindling bank balance forces her to agree. Leeson is a man who measures himself by financial success, while Vera couldn't be less interested in material things. And both have secrets they are desperate to hide. But the more time they spend together, the more they struggle to resist the powerful attraction between them. Knowing the truth would ruin him, Leeson avoids commitment. But when Vera works up the courage to reveal her past, Leeson falls hard for the bravest woman he has ever met. Can two people from very different worlds overcome their fears and learn to trust in love and one another? A moving, contemporary romance about love against all the odds. 'I will definitely be reading more from Madeline Ash.' – Reading Rehab 'Every once in a while we come across a book that just clicks – it ticks all the boxes of what we feel makes up a perfect story. For me, 'Uncovered by Love' was one of these rare finds.' – Romance Novel News 'an emotionally wrought, beautifully exquisite, love story that will keep you hanging on to every word…Madeline Ash has managed to write the perfect love story. .. I am eagerly awaiting the next book by Ms. Ash and she has been added to my favorite author's list!' – Harlequin Junkie OTHER BOOKS BY MADELINE ASH: The Playboy's Dark Secret Love & Other Lies"
  },
  {
    "title": "A Fine Romance",
    "authors": [
      "Candice Bergen"
    ],
    "published_year": "2016",
    "publisher": "Simon and Schuster",
    "description": "In a follow-up to Knock Wood, the Emmy Award-winning actress traces the milestone events of her life, including her first marriage, the birth of her daughter, her work on Murphy Brown and her struggles with widowhood."
  },
  {
    "title": "Reading the Romance",
    "authors": [
      "Janice A. Radway"
    ],
    "published_year": "2009",
    "publisher": "Univ of North Carolina Press",
    "description": "Originally published in 1984, Reading the Romance challenges popular (and often demeaning) myths about why romantic fiction, one of publishing's most lucrative categories, captivates millions of women readers. Among those who have disparaged romance reading are feminists, literary critics, and theorists of mass culture. They claim that romances enforce the woman reader's dependence on men and acceptance of the repressive ideology purveyed by popular culture. Radway questions such claims, arguing that critical attention \"must shift from the text itself, taken in isolation, to the complex social event of reading.\" She examines that event, from the complicated business of publishing and distribution to the individual reader's engagement with the text. Radway's provocative approach combines reader-response criticism with anthropology and feminist psychology. Asking readers themselves to explore their reading motives, habits, and rewards, she conducted interviews in a midwestern town with forty-two romance readers whom she met through Dorothy Evans, a chain bookstore employee who has earned a reputation as an expert on romantic fiction. Evans defends her customers' choice of entertainment; reading romances, she tells Radway, is no more harmful than watching sports on television. \"We read books so we won't cry\" is the poignant explanation one woman offers for her reading habit. Indeed, Radway found that while the women she studied devote themselves to nurturing their families, these wives and mothers receive insufficient devotion or nurturance in return. In romances the women find not only escape from the demanding and often tiresome routines of their lives but also a hero who supplies the tenderness and admiring attention that they have learned not to expect. The heroines admired by Radway's group defy the expected stereotypes; they are strong, independent, and intelligent. That such characters often find themselves to be victims of male aggression and almost always resign themselves to accepting conventional roles in life has less to do, Radway argues, with the women readers' fantasies and choices than with their need to deal with a fear of masculine dominance. These romance readers resent not only the limited choices in their own lives but the patronizing atitude that men especially express toward their reading tastes. In fact, women read romances both to protest and to escape temporarily the narrowly defined role prescribed for them by a patriarchal culture. Paradoxically, the books that they read make conventional roles for women seem desirable. It is this complex relationship between culture, text, and woman reader that Radway urges feminists to address. Romance readers, she argues, should be encouraged to deliver their protests in the arena of actual social relations rather than to act them out in the solitude of the imagination. In a new introduction, Janice Radway places the book within the context of current scholarship and offers both an explanation and critique of the study's limitations."
  },
  {
    "title": "There's Something about Sweetie",
    "authors": [
      "Sandhya Menon"
    ],
    "published_year": "2019",
    "publisher": "Simon Pulse",
    "description": "“Adorable, joyous.” —BuzzFeed “I’m head-over-heels for this charming, funny, romantic, life-affirming book.” —Becky Albertalli, New York Times bestselling author of Simon vs. the Homo Sapiens Agenda and Leah on the Offbeat The irresistible companion novel to the New York Times bestseller When Dimple Met Rishi, which follows Rishi’s brother, Ashish, and a confident, self-proclaimed fat athlete named Sweetie as they both discover what love means to them. Ashish Patel didn’t know love could be so…sucky. After being dumped by his ex-girlfriend, his mojo goes AWOL. Even worse, his parents are annoyingly, smugly confident they could find him a better match. So, in a moment of weakness, Ash challenges them to set him up. The Patels insist that Ashish date an Indian-American girl—under contract. Per subclause 1(a), he’ll be taking his date on “fun” excursions like visiting the Hindu temple and his eccentric Gita Auntie. Kill him now. How is this ever going to work? Sweetie Nair is many things: a formidable track athlete who can outrun most people in California, a loyal friend, a shower-singing champion. Oh, and she’s also fat. To Sweetie’s traditional parents, this last detail is the kiss of death. Sweetie loves her parents, but she’s so tired of being told she’s lacking because she’s fat. She decides it’s time to kick off the Sassy Sweetie Project, where she’ll show the world (and herself) what she’s really made of. Ashish and Sweetie both have something to prove. But with each date they realize there’s an unexpected magic growing between them. Can they find their true selves without losing each other?"
  },
  {
    "title": "The Happily Ever After",
    "authors": [
      "Avi Steinberg"
    ],
    "published_year": "2020",
    "publisher": "Nan A. Talese",
    "description": "A memoir about writing a novel about searching for love. Is romance dead? Is that why there are so many vampires in today's romance novels? When Avi Steinberg's love life took a grim turn, he did what he always does: He consulted his old books, the usual cast of Great (Very Serious, Usually Male) Authors. And he immediately realized that these books were part of the problem. Instead, he began to read romances, the books he--like so many of us--have been conditioned to dismiss as \"trashy.\" What he discovered was a genre that was tremendously diverse and daring, along with a vast network of innovative writers who were keeping the novel as alive as ever. His own relationship problems, he realized, came down to a failure of his imagination. And so he set out on a quest to write and publish a romance novel and to find real-life love. A hybrid of memoir, travelogue, and critical essay, The Happily Ever After chronicles an adventure in a brave new world of literature. Steinberg offers a report from the trenches of romance, moving between major industry conferences and writing groups at the local bar as he works and reworks his romance novel idea. He reveals the inside scoop from a major romance publishing house, crisscrosses the country meeting mysterious ghostwriters and Fabio's great unsung rival, and offers a running take on the fascinating history of romance writing, the genre that invented, and continues to reinvent, the modern novel. Along the way he meets many readers, each of whom sheds light on why we are so fascinated by--and phobic of--romance fiction and what the vitality and fractiousness of our biggest genre says about us. With quirky wit and disarming honesty, Steinberg captures an often misunderstood literary culture and learns, from its devoted practitioners, how to take the Happily Ever After seriously in his own life."
  },
  {
    "title": "Love is Rage",
    "authors": [
      "Shanna Bell"
    ],
    "published_year": "2020",
    "publisher": "Bell Press",
    "description": "Sixteen years ago, Elena had to betray Viking in order to save him. Now, he’s hungry for revenge against the woman who was once his obsession. As he takes her captive and seeks to break her, a dark desire reignites… Could you give love a second chance after a betrayal? Elena. Viking is the love of my life. I both saved and betrayed him. Now, I'm at his mercy. One look in his eyes and I know he wants to break me. Fight or flight? Viking. Elena was the love of my life, my obsession, and my ruin. Sixteen years ago, she betrayed me by marrying my enemy. Now, I discover her betrayal didn't end there; she stole my kid. I’m gonna take away her future, just like she took mine. Note: - This book contains some traumas. If this offends you, please skip this one in the series. - It can be read as a stand-alone. No cliffhanger. For fans of Monica James, Natasha Knight, Julia Sykes, CD Reiss, Aleatha Romig, Skye Warren, Anna Zaires, Renee Rose, Carrie Ann Ryan, Penelope Ward, Lauren Blakely, Meghan March, Vanessa Vale, Katee Robert. Topics: adult romance, alpha male, romantic suspense, romance series, bad boy romance, emotional read, contemporary romance, inspirational romance, mafia romance, romance audiobook, second chance at love, sexually romantic books, contemporary romance books, revenge romance, steamy romance books, hidden pregnancy romance."
  },
  {
    "title": "A Lot Like Paradise",
    "authors": [
      "Kathryn Cantrell"
    ],
    "published_year": "2022",
    "publisher": "Brazoria House Books",
    "description": "Destiny didn’t get the memo that bad boys are not her cup of tea… Navy veteran Max Braun dives head first into whatever he’s passionate about and Lina Elliot is no exception. When the town’s matchmaker gives them both love predictions that say they’re fated for each other, he’s all in. For now. Love never lasts, right? Lina Elliot followed her sister to Superstition Springs in hopes of finding her own happily ever after. But she never expected a rollercoaster ride named Max to immediately pursue her. His teammates call him Maximum and it’s no mystery why—he’s over the top about everything. Including her. When they’re assigned as co-organizers for an art festival benefiting the new veteran’s center, things get intense fast. How can she give in to what may be the greatest adventure of her life when fate has always ripped away everything she’s ever cared about? Small town military heroes—all swoon, no steam Welcome to Superstition Springs, the place where destiny is the ultimate matchmaker. All you have to do is believe. Keywords: contemporary romance, small town, small town romance, friends to lovers, military romance, series, romantic series, women’s fiction, romance saga, romantic small town, series starter, first in series, first in series free, romance series, romance saga, romantic family saga, heartwarming, heart-warming, heartwarming romance, clean & wholesome, clean & wholesome romance, family, love, love books, kissing books, emotional journey, captivating romance, emotional, healing, swoon, funny romance, modern romance, new release, matchmaker, alpha hero, military hero, hero with a heart of gold, strong female lead, strong heroine"
  },
  {
    "title": "Romance By The Book",
    "authors": [
      "Sarah Ready"
    ],
    "published_year": "2021",
    "publisher": "W. W. Crown",
    "description": "Book-loving, librarian Jessie has loved Gavin Williams for practically her whole life. So when a psychic predicts that Gavin is Jessie's one fated soul mate, she's ecstatic. There's just one itty bitty little problem. Gavin's engaged to marry another woman. What's a book lover to do? Easy. Check out dozens of romance books, study the (totally realistic) way characters fall in love, and make a foolproof plan on how to win her soul mate (in one week). Meet cute? Check. Dance under the stars? Check. Kiss in the rain? Check. Romance books don't lie - it'll all go perfectly. Except, there's another problem. Gavin's twin brother: William Williams IV. Jessie has hated William for as long as she's loved his brother. William is grump to Jessie's sunshine, stand-offish to her extrovert, cold to her warm. And when William learns of Jessie's plan to derail his brother's engagement he swears that he'll do anything to stop her. But after William and Jessie (unwillingly) share a dance...a romantic dinner...a kiss...Jessie starts to wonder, is William actually her soul mate? Or is this just another one of his games? She's can't tell, because this romance definitely isn't going by the book. Romance by the Book is Book 3 in Sarah Ready's Soul Mates in Romeo Romance Series."
  },
  {
    "title": "Romance",
    "authors": [
      "Walter Raleigh"
    ],
    "published_year": "2018",
    "publisher": "BoD – Books on Demand",
    "description": "Reproduction of the original: Romance by Walter Raleigh"
  },
  {
    "title": "Dancing in the Moonlight",
    "authors": [
      "RaeAnne Thayne"
    ],
    "published_year": "2015",
    "publisher": "HQN Books",
    "description": "LIEUTENANT MAGDALENA CRUZ HAD COME HOME… But it wasn't the way she'd envisioned her return. And though all she wanted was to be alone, infuriatingly handsome Dr. Jake Dalton—of the enemy Daltons—wouldn't cooperate. And she needed him to, because the walls around her heart were dangerously close to crumbling every time he came near… Jake had spent most of his life trying to get closer to Maggie, with little to show for it. But she was the woman he'd always wanted, and no injury in the world could change that. Now if only he could convince her that the woman who stood before him was beautiful, desirable, whole…and meant to be his… Previously Published."
  },
  {
    "title": "Her Dark Secret",
    "authors": [
      "Michelle Love"
    ],
    "published_year": "2020",
    "publisher": "Blessings For All SC",
    "description": "Enjoy this bad boy billionaire romance. She is the last person I should fall in love with ... And yet it was inevitable. The moment I set eyes on Temple Dubois, I knew I had to have her. Her beautiful face, her smile, the body that haunts my dreams. I need her in my bed, in my life. The scent of her skin, the way the curves of her body cling to me ... God, she's incredible. And a virgin ... Before I'm done with her, I'll make sure she's as insatiable as I am ... what am I saying? I'll never be done with her. She's my life now ... Keywords: Billionaire romance, bad boy, new adult, instalove, age gap romance, alpha male, new adult romance, steamy romance, age gap romance older man younger woman, sweet romance, romantic novels, love, action, adventure, sexually romantic books, hot, alpha hero, contemporary romance, guaranteed HEA, no cliffhangers, sweet romance, love books, love stories."
  },
  {
    "title": "Nothing But This",
    "authors": [
      "Natasha Anders"
    ],
    "published_year": "2019",
    "publisher": "Montlake Romance",
    "description": "A married couple yearns to rediscover lost love in this novel about forgiveness, reconciliation, and emotional growth. It's always been complicated between Libby Lawson and Greyson Chapman--and married life isn't any simpler. But when Libby gets pregnant, she at last sees a bright future ahead. There's just one problem: Greyson says he's sterile. Furious, Greyson abandons the young family. Equally furious and deeply hurt, Libby cuts all ties with him. After all these years, it seems their relationship has finally expired. But love is resilient and endures even when you don't want it to. Greyson still longs for Libby, and though Libby's heartbroken by Greyson's lack of trust, she holds out hope for a complete, happy family. And so they embark on the journey back to each other, wary of all the obstacles between them. It's been a long road already--one strewed with fear, doubt, and misunderstandings. Will they keep looking to the past, or will they look to each other and walk hand in hand toward a broad new horizon?"
  },
  {
    "title": "The Rocky Road to Romance",
    "authors": [
      "Janet Evanovich"
    ],
    "published_year": "2009",
    "publisher": "Harper Collins",
    "description": "“[Evanovich] is funny and ceaselessly inventive.\" —Los Angeles Times Book Review “Do yourself a favor and read this one.” —Washington Post The author of so many spectacularly successful mystery novels featuring the inimitable Stephanie Plum, #1 New York Times bestselling author Janet Evanovich displays a more playfully romantic side with The Rocky Road to Romance. Evanovich delights with a classic, pre-Plum contemporary romance novel that’s sure to please—a lighthearted tale of three-way love affair involving a radio “dog lady”-turned-traffic reporter, her handsome program director, and a huge couch potato canine named Bob."
  },
  {
    "title": "Untamed Passion",
    "authors": [
      "Cat Schield"
    ],
    "published_year": "2020",
    "publisher": "Harlequin",
    "description": "Feel the drama and passion in the Dynasties: Seven Sins series! One spectacular night… with an explosive aftermath! Desire as volatile as theirs has consequences that could last a lifetime… When a single rapturous night with Sammi Guzman leaves the intoxicating model pregnant, photographer Oliver Lowell is determined to embrace his responsibilities. But his wrath over his father’s numerous betrayals has haunted him for years and leaves Oliver feeling ill equipped for parenthood. Passion has never been his and Sammi’s problem, but will this black sheep tame his demons for good? Harlequin Desire: Luxury, scandal, desire—welcome to the lives of the American elite. One man’s betrayal can destroy generations. Fifteen years ago, a hedge-fund hotshot vanished with billions, leaving the high-powered families of Falling Brook changed forever. Now seven heirs, shaped by his betrayal, must reckon with the sins of the past. Passion may be their only path to redemption. Experience all Seven Sins! DYNASTIES: SEVEN SINS Book 1: Ruthless Pride by Naima Simone This CEO’s pride led him to give up his dreams for his family. Now he’s drawn to the woman who threatens everything… Book 2: Forbidden Lust by Karen Booth He’s always resisted his lust for his best friend’s sister—until they’re stranded together in paradise… Book 3: Insatiable Hunger by Yahrah St. John His unbridled appetite for his closest friend is unleashed when he believes she’s fallen for the wrong man… Book 4: Hidden Ambition by Jules Bennett Ambition has taken him far, but revenge could cost him his one chance at love… Book 5: Reckless Envy by Joss Wood When this shark in the boardroom meets the one woman he can’t have, envy takes over… Book 6: Untamed Passion by Cat Schield Will this black sheep’s self-destructive wrath flame out when he’s expecting an heir of his own? Book 7: Slow Burn by Janice Maynard If he’s really the idle playboy his family claims, will his inaction threaten a reunion with the woman who got away?"
  },
  {
    "title": "The Romance of a Plain Man",
    "authors": [
      "Ellen Glasgow"
    ],
    "published_year": "2016",
    "publisher": "The Floating Press",
    "description": "In the 1800s, the American South was a highly stratified society in which different classes rarely intermingled. By the early twentieth century, the rise of a new class of nouveau riche titans of industry began to change that. It is against this backdrop of transition that Ellen Glasgow sets her novel The Romance of a Plain Man. The story follows poor but honorable Ben Starr as he works his way up the socioeconomic ladder in pursuit of the daughter of an aristocratic family."
  },
  {
    "title": "Her Texas Rebel",
    "authors": [
      "LeAnne Bristow"
    ],
    "published_year": "2017",
    "publisher": "Harlequin",
    "description": "He left so fast, she never got a chance… He abandoned her when she needed him most, just as she'd discovered she was pregnant. And now, ten years later, struggling single mother Sabrina Davis has come home in search of refuge for her at-risk son. Except Tony Montoya, now a cop, has also returned to Salt Creek, Texas. Recovering from being shot in the line of duty, Tony plans to use this time in his hometown to make amends for the trouble he caused as a youth. Amends for breaking Sabrina's heart. But trouble seems to follow the police officer no matter where he goes, and he doesn't want to hurt the woman he never stopped loving…or the son he's just found."
  },
  {
    "title": "Flashback",
    "authors": [
      "Thea Harrison"
    ],
    "published_year": "2021",
    "publisher": "Teddy Harrison LLC",
    "description": "From New York Times best-selling author Thea Harrison comes a vintage contemporary romance, originally published under Amanda Carpenter in 1984. Dana Haslow’s telepathic abilities are more curse than blessing. Tormented by constant nightmares and convinced death will be her only respite, she isolates herself. Not even her isolation is safe, though, as a new neighbor’s internal torment spills over into Dana’s sleeping hours, unwittingly forcing her to experience the horrors of his past through a series of night terrors that will overwhelm her if she can’t convince him to accept help. David Raymond is a Vietnam vet with PTSD and no desire to confront his demons—no matter how much a certain new neighbor pushes him to do so. David doesn’t want Dana’s help, but when Dana becomes the unwilling obsession of a dangerous local man, David realizes he needs her. Can these two damaged souls find healing together? Or will someone deprive them of the chance?"
  },
  {
    "title": "Royally Rearranged",
    "authors": [
      "Emma St Clair"
    ],
    "published_year": "2021",
    "publisher": "Independently Published",
    "description": "There WILL be a royal wedding. The only question--who will be my groom? An arranged marriage isn't the worst fate for a princess like me. Especially because I've been in love with my intended groom since we were children. But when my prince shows up with an American girlfriend instead of an engagement ring, all arrangements are off. The clock is nearing midnight--I won't turn into a pumpkin, but if I'm not wed by summer's end, I'll forfeit my kingdom. Just your typical royal dilemma. Out of sheer desperation, I make a deal with a devilish duke. Rafe de Silva is the prince's rival and has a plan so ridiculous it just might work. One moment, Rafe seems to relish making the prince jealous. And the next... he's making me question everything with his words, his touch, and his ability to melt my Ice Princess persona. I'm not always given the luxury of choice, but now I have a huge one to make. I only hope I don't lose my crown, my heart, or myself in the process... Royally Rearranged is a sizzling, swoony, closed-door romantic comedy."
  },
  {
    "title": "INJURED INNOCENT",
    "authors": [
      "Penny Jordan"
    ],
    "published_year": "2016",
    "publisher": "Harlequin",
    "description": "Read this classic Harlequin Presents from NYT bestselling author Penny Jordan! A marriage of convenience—to her enemy! Once Joel and Lissa had known each other as teenagers. She’s spent the intervening years wanting to forget him! Only now they are fighting over custody of her sister’s young daughters. And Joel has a shocking proposal to break the deadlock: they get married! She might have loved him once, but this is the man she’s hated for years! But for her sister’s sake she’s sworn she’d do anything for her nieces…even this? Originally published in 1985."
  },
  {
    "title": "The Story of a Whim (Musaicum Romance Classics)",
    "authors": [
      "Grace Livingston Hill"
    ],
    "published_year": "2020",
    "publisher": "e-artnow",
    "description": "\"The Story of a Whim \" is a story of a mistaken identity that turned into a beautiful romance. When a group of young girls who see some ragged furniture waiting to be shipped away, they assume, from the name on the address label, that it is going to a woman, and imagine a story for her life. Once the girls find out that the person they were sending the furniture was a male, the romance is about to burst."
  },
  {
    "title": "Promised",
    "authors": [
      "Lisa Lang Blakeney"
    ],
    "published_year": "2018",
    "publisher": "Writergirl Press",
    "description": "King Brother Drama. King Brother Hotness. A King Happily Ever After. You are cordially invited to A King Family Wedding. The question is which one of the Kings will make it to the altar? Follow these three badass brothers as they unapologetically claim their forever after in this short and sweet romance. This is a King Brothers Mafia Romance novel. It is a standalone book, featuring 3 strong alphas with no cheating, (and as always) a happily ever after. *** ﻿Themes of this novel are: possessive alpha romance, enemies-to-lovers, dominant male, soul mate, fated love, strong hero, strong heroine, love triangle, billionaire, bad boy good girl, antihero Topics for this novel include: Quiet Alpha Male Romance Book, Mafia romance enemies to lovers, Possessive alpha romance, Alpha romance, Alpha romance billionaire, Alpha romance books, Alpha romance dominant, Alpha romance novels, Alpha romance series, Alpha male books, Jealous possessive alpha male romance books, Romance books alpha male, Mafia romance, Dark mafia romance, Mafia romance books, Mafia romance suspense, mafia romances, dark romance, dark romance mafia, alpha business man book, billionaire romance, billionaire romance series, possessive alpha romance, contemporary romance, contemporary, romance novels, the best romance series ever, bestselling series, Billionaire, billionaire romance, sex, love scenes, romantic suspense, good girl, bad boy romance, contemporary romance, betrayal, organized crime, thriller, suspense, billionaire suspense, rich ceo, alpha male, action adventure, curvy, fantasy"
  },
  {
    "title": "No Place Like Home",
    "authors": [
      "Debbie Macomber",
      "Sheila Roberts",
      "Brenda Novak",
      "Susan Wiggs"
    ],
    "published_year": "2018",
    "publisher": "MIRA",
    "description": "Four heartwarming stories of finding love in friendly small towns, from bestselling and favorite authors, together for the first time in one value-packed box set! 16 Lighthouse Road by Debbie Macomber Welcome to Cedar Cove, Washington, where the news of the day is that family court Judge Olivia Lockhart has denied the divorce petition of a young local couple. Olivia is trusting her instincts that the two need to try again. Newspaper editor Jack Griffin admires Olivia’s choice, and the woman herself. Now Olivia has her hands full between her work and her tricky relationships with her daughter and her mother—and now Jack’s courtship. Everyone in Cedar Cove is talking! The 10-Year Reunion by Susan Wiggs Beautician Twyla McCabe was voted most likely to succeed in her high school graduating class, but a run of bad luck forced her to give up her dreams of college and a career. Now a widow with a six-year-old and essentially Dear Abby with a blow-dryer, she longs to show up at her ten-year school reunion with a date she can show off. But when her well-meaning customers arrange for her to attend the Hell Creek High School Reunion with Rob Carter, M.D., Twyla knows they’ve gone too far. Who would believe a woman who dyes hair for a living could be engaged to such a hunk? No One But You by Brenda Novak Silver Springs, a picturesque small town in Southern California where even the hardest hearts can learn to love again… Sadie Harris is out of options, and desperately determined not to lose the custody battle for her son, so she takes position assisting Dawson Reed—who recently stood trial for murder. Dawson just wants to leave his painful past behind and fix up the family farm. As their professional relationship grows into something else, Sadie realizes that Dawson has a good heart, one that might be worth fighting for. Welcome to Moonlight Harbor by Sheila Roberts For her fortieth birthday, Jenna Jones is getting a divorce. She’s barely able to support herself and her teenage daughter, and now her deadbeat ex is demanding spousal support! The unexpected gift of being asked to manage the Driftwood Inn for her aging Aunt Edie might be the rainbow at the end of the storm. Or not. The coastal town is a little more run-down that Jenna remembered, and the inn is worse. But with the help of her new friends and a couple of handsome citizens, perhaps the sunshine is on the horizon after all. Because, no matter what, life is always good at the beach."
  },
  {
    "title": "A Game Between Friends",
    "authors": [
      "Yahrah St. John"
    ],
    "published_year": "2022",
    "publisher": "Harlequin",
    "description": "Will these former friends with benefits rekindle a flame…or settle scores? Find out in Yahrah St. John’s Locketts of Tuxedo Park series finale! From lovers to friends to lovers again? It’s complicated! After losing his football career due to an injury, Xavier Lockett found solace in the arms of singer Porscha Childs…until a misunderstanding tore them apart. Now a sportscaster at a top Atlanta network, the former star quarterback craves another taste of the woman who helped him turn his life around. But Porscha wants a hit record, not a second broken heart. Yet Xavier’s still irresistible. The sparks between them ignite an inferno that lands her in his bed, but can she trust that this time they’re both playing the same game? From Harlequin Desire: A luxurious world of bold encounters and sizzling chemistry. Love triumphs in these uplifting romances, part of the Locketts of Tuxedo Park series: Book 1: Consequences of Passion Book 2: Blind Date with the Spare Heir Book 3: Holiday Playbook Book 4: A Game Between Friends"
  },
  {
    "title": "A ROYAL ROMANCE",
    "authors": [
      "Tomoko Sato",
      "VALERIE PARV"
    ],
    "published_year": "2020",
    "publisher": "Harlequin / SB Creative",
    "description": "She’s been summoned to be this scornful man’s bride? Norah is visiting the island country of Sapphan for the first time in five years. The last time she came, she had a terrible experience with Prince Philippe. He called her a vulgar woman yet forced a kiss on her. Norah still cannot forget the frustrating yet sweet sensation of the kiss. Despite making an effort to avoid him, Norah reunites with the prince, who is still as scornful as she remembers. She is shocked when he declares that she has been summoned to become his bride!"
  },
  {
    "title": "Undaunted",
    "authors": [
      "Diana Palmer"
    ],
    "published_year": "2018",
    "publisher": "HQN Books",
    "description": "Inspired by her classic romance \"Bound by a Promise, New York Times\"- and \"USA Today\"-bestselling phenomenon Palmer returns with her trademark rugged heroes and relatable heroines in her most emotionally compelling romance to date."
  },
  {
    "title": "Bad News",
    "authors": [
      "Stacy Travis"
    ],
    "published_year": "2020",
    "publisher": "Fast Turtle Press",
    "description": "Two driven reporters. One weekend. Infinite heat! Jack Galloway has the brilliant mind, chiseled jaw, and deep blue eyes that light me on fire. He's an award-winning journalist and a star at The Examiner. Oh, and I hate his arrogant guts. He told my boss that I can't hack it as a reporter, that it was a mistake to hire me. But I just landed a story that will launch my career and prove him forever wrong. Yeah, it steps on Jack's beat a little. Okay, a lot. So our boss is making us report it together. At a gorgeous oceanfront villa for an entire weekend. Jack brings out my insecurities. He makes me doubt my instincts. And ignites a desire in me that I haven't felt before. But there's something he's not telling me. I know I'm risking something by pursuing this story. And if I have to choose, will it be the story? Or him? Is it true love? Or is he just bad news? **A stand-alone enemies-to-lovers romance**"
  },
  {
    "title": "Rekindled Romance",
    "authors": [
      "Lorraine Beatty"
    ],
    "published_year": "2013",
    "publisher": "HarperCollins Australia",
    "description": "Forced to return home after a health scare, Shelby Russell winds up next door to none other than Matt Durrant. Her onetime fiancé and now a widower with two kids, Matt plans to keep Shelby at arm's length. Even if she's the logical choice for a nanny. Even if his kids love her. Even if he's happier than he's been in years. But Matt was the one left behind when Shelby went to follow her dreams. After losing so much, Matt knows his courage is faltering. And when he learns the truth about what Shelby faces now, they'll both need a heavy dose of courage if they dare hope for a future."
  },
  {
    "title": "The Mischievous Miss Charlotte",
    "authors": [
      "Maggie Dallen"
    ],
    "published_year": "2022",
    "publisher": "Maggie Dallen",
    "description": "She's falling for the one man she's sworn to hate... Miss Charlotte despises the man she's supposed to marry. Of course, she hasn't actually met the Earl's son, but from the letters they've exchanged, he's exactly the sort of overbearing brute she can't stand. Not at all like that handsome, witty, romantic stranger she met at the bookshop. She agrees to meet this intriguing stranger in the garden at midnight, not realizing that the man she's agreed to meet...is the same man she's vowed to hate. A sweet, clean & wholesome regency romance. Filled with dukes, earls, marquesses, and swoonworthy kisses, be sure to check out the romantic adventures of the students at the School of Charm. Appropriate for all ages, these full-length, standalone regency romance novels are sure to make you smile."
  },
  {
    "title": "The Politics Book",
    "authors": [
      "DK"
    ],
    "published_year": "2015",
    "publisher": "Penguin",
    "description": "Learn about how the world of government and power works in The Politics Book. Part of the fascinating Big Ideas series, this book tackles tricky topics and themes in a simple and easy to follow format. Learn about Politics in this overview guide to the subject, great for novices looking to find out more and experts wishing to refresh their knowledge alike! The Politics Book brings a fresh and vibrant take on the topic through eye-catching graphics and diagrams to immerse yourself in. This captivating book will broaden your understanding of Politics, with: - More than 100 groundbreaking ideas in the history of political thought - Packed with facts, charts, timelines and graphs to help explain core concepts - A visual approach to big subjects with striking illustrations and graphics throughout - Easy to follow text makes topics accessible for people at any level of understanding The Politics Book is a captivating introduction to the world's greatest thinkers and their political big ideas that continue to shape our lives today, aimed at adults with an interest in the subject and students wanting to gain more of an overview. Delve into the development of long-running themes, like attitudes to democracy and violence, developed by thinkers from Confucius in ancient China to Mahatma Gandhi in 20th-century India, all through exciting text and bold graphics. Your Politics Questions, Simply Explained This engaging overview explores the big political ideas such as capitalism, communism, and fascism, exploring their beginnings and social contexts - and the political thinkers who have made significant contributions. If you thought it was difficult to learn about governing bodies and affairs, The Politics Book presents key information in a clear layout. Learn about the ideas of ancient and medieval philosophers and statesmen, as well as the key personalities of the 16th to the 21st centuries that have shaped political thinking, policy, and statecraft. The Big Ideas Series With millions of copies sold worldwide, The Politics Book is part of the award-winning Big Ideas series from DK. The series uses striking graphics along with engaging writing, making big topics easy to understand."
  },
  {
    "title": "Piano Literature - Book 1: Developing Artist Original Keyboard Classics",
    "authors": [
      "Randall Faber",
      "Nancy Faber"
    ],
    "published_year": "1999",
    "publisher": "Hal Leonard Corporation",
    "description": "(Faber Piano Adventures ). This collection of 21 authentic keyboard works represents the major periods of music - from Baroque to Contemporary - and serves as an excellent introduction to classical keyboard literature. Contents: VON DER HOFE: Canario * PRAETORIUS: Procession in G * TELEMANN: Gavott in C * MOURET: The Highlander * HOOK: Bagatelle * Minuet * TURK: Little Dance * DIABELLI: Morning * HAYDN: Quadrille * ATTWOOD: Sonatina in G * J.C. BACH: Adagio and Allegro * SCHYTTE: Little Prelude * Melody for Left Hand * SPINDLER: Two Preludes * WOHLFAHRT: Waltz for Four Hands * GURLITT: The Hunt * LYNES: Tarantella * ALT: On the Ocean Floor * DUBLIANSKY: The Busy Machine * SALUTRINSKAYA: Shepherd Pipes * FABER: Pantomime"
  },
  {
    "title": "\"What is Literature?\" and Other Essays",
    "authors": [
      "Jean-Paul Sartre"
    ],
    "published_year": "1988",
    "publisher": "Harvard University Press",
    "description": "What is Literature? challenges anyone who writes as if literature could be extricated from history or society. But Sartre does more than indict. He offers a definitive statement about the phenomenology of reading, and he goes on to provide a dashing example of how to write a history of literature that takes ideology and institutions into account."
  },
  {
    "title": "Pathetic Literature",
    "authors": [
      "Eileen Myles"
    ],
    "published_year": "2022",
    "publisher": "Grove Press",
    "description": "An utterly unique collection composed by the award-winning poet and writer, a global anthology of pieces from lesser-known classics by luminaries like Franz Kafka, Samuel R. Delany, and Gwendolyn Brooks to up-and-coming writers that examine pathos and feeling, giving a well-timed rehab to the word “pathetic” “Literature is pathetic.” So claims Eileen Myles in their provocative and robust introduction to Pathetic Literature, a breathtaking mishmash of pieces ranging from poems to theater scripts to prose to anything in between, all exploring the so-called “pathetic” or awkwardly-felt moments and revelations around which lives are both built and undone. Myles first reclaimed the word for a seminar they taught at the University of California San Diego in the early 2000s, rescuing it from the derision into which it had slipped and restoring its original meaning of inspiring emotion or feeling, from the Ancient Greek rhetorical method pathos. Their identification of “pathetic” as ripe for reinvention forms the need for this anthology, which includes a hearty 106 contributors, encompassing canonical global stars like Robert Walser, Jorge Luis Borges, Rumi, and Gwendolyn Brooks, literary libertines like Dodie Bellamy, Samuel R. Delany, and Bob Flanagan, as well as extraordinary writers on the rise, including Nicole Wallace, Precious Okoyomon, and Will Farris. Wrenching and discomfiting prose by Karla Cornejo Villavicencio, Jack Halberstam, and Porochista Khakpour rubs shoulders with poems by Natalie Diaz, Victoria Chang, Lucille Clifton, and Ariana Reines, and butts up against fiction from Chester Himes, Djuna Barnes, Chris Kraus, and Qiu Miaojin, among so many others, including Myles’s own opening salvo of their 1992 presidential campaign. The result is a completely anomalous and uplifting anthology that encourages a fresh political discourse on literature, as well as supplying an essential compendium of pained, awkward, queer, trans, gleeful, and ever-jarring ways to think differently and live pathetically on a polarized and fearful planet."
  },
  {
    "title": "Bourdieu and Literature",
    "authors": [
      "John R. W. Speller"
    ],
    "published_year": "2011",
    "publisher": "Open Book Publishers",
    "description": "Bourdieu and Literature is a wide-ranging, rigorous and accessible introduction to the relationship between Pierre Bourdieu's work and literary studies. It provides a comprehensive overview and critical assessment of his contributions to literary theory and his thinking about authors and literary works. One of the foremost French intellectuals of the post-war era, Bourdieu has become a standard point of reference in the fields of anthropology, linguistics, art history, cultural studies, politics, and sociology, but his longstanding interest in literature has often been overlooked. This study explores the impact of literature on Bourdieu's intellectual itinerary, and how his literary understanding intersected with his sociological theory and thinking about cultural policy. This is the first full-length study of Bourdieu's work on literature in English, and it provides an invaluable resource for students and scholars of literary studies, cultural theory and sociology."
  },
  {
    "title": "How Literature Works",
    "authors": [
      "John Sutherland"
    ],
    "published_year": "2011",
    "publisher": "Oxford University Press",
    "description": "How Literature Works is an indispensable book for any reader seeking a greater appreciation of their favorite novel, poem, or play. It offers a lively and straightforward guide to literary thinking. With a series of compact essays, the renowned literary critic John Sutherland--widely admired for his wit and clear reasoning--strips away the obscurity and pretension of literary study. His book offers concise definitions and clear examples of the fifty concepts that all book lovers should know. It includes basic descriptive terms (ambiguity, epic), the core vocabulary of literary culture (genre, style), and devices employed by authors (irony, defamiliarization). More broadly, How Literature Works explores the animating concepts behind literary theory (textuality, sexual politics), traces the forces that impact literature's role in the real world (obscenity, plagiarism), and grapples with the future of reading (fanfic, e-book). For any reader who wants to get the most out of the literature they read, Sutherland's short sharp book will both inform and delight."
  },
  {
    "title": "Anti-Literature",
    "authors": [
      "Adam Joseph Shellhorse"
    ],
    "published_year": "2017",
    "publisher": "University of Pittsburgh Press",
    "description": "Anti-Literature articulates a rethinking of what is meant today by \"literature.\" Examining key Latin American forms of experimental writing from the 1920s to the present, Adam Joseph Shellhorse reveals literature's power as a site for radical reflection and reaction to contemporary political and cultural conditions. His analysis engages the work of writers such as Clarice Lispector, Oswald de Andrade, the Brazilian concrete poets, Osman Lins, and David Vi–as, to develop a theory of anti-literature that posits the feminine, multimedial, and subaltern as central to the undoing of what is meant by \"literature.\" By placing Brazilian and Argentine anti-literature at the crux of a new way of thinking about the field, Shellhorse challenges prevailing discussions about the historical projection and critical force of Latin American literature. Examining a diverse array of texts and media that include the visual arts, concrete poetry, film scripts, pop culture, neo-baroque narrative, and others that defy genre, Shellhorse delineates the subversive potential of anti-literary modes of writing while also engaging current debates in Latin American studies on subalternity, feminine writing, posthegemony, concretism, affect, marranismo, and the politics of aesthetics."
  },
  {
    "title": "What Is World Literature?",
    "authors": [
      "David Damrosch"
    ],
    "published_year": "2018",
    "publisher": "Princeton University Press",
    "description": "World literature was long defined in North America as an established canon of European masterpieces, but an emerging global perspective has challenged both this European focus and the very category of \"the masterpiece.\" The first book to look broadly at the contemporary scope and purposes of world literature, What Is World Literature? probes the uses and abuses of world literature in a rapidly changing world. In case studies ranging from the Sumerians to the Aztecs and from medieval mysticism to postmodern metafiction, David Damrosch looks at the ways works change as they move from national to global contexts. Presenting world literature not as a canon of texts but as a mode of circulation and of reading, Damrosch argues that world literature is work that gains in translation. When it is effectively presented, a work of world literature moves into an elliptical space created between the source and receiving cultures, shaped by both but circumscribed by neither alone. Established classics and new discoveries alike participate in this mode of circulation, but they can be seriously mishandled in the process. From the rediscovered Epic of Gilgamesh in the nineteenth century to Rigoberta Menchú's writing today, foreign works have often been distorted by the immediate needs of their own editors and translators. Eloquently written, argued largely by example, and replete with insightful close readings, this book is both an essay in definition and a series of cautionary tales."
  },
  {
    "title": "Text Book",
    "authors": [
      "Robert Scholes",
      "Nancy R. Comley",
      "Gregory L. Ulmer"
    ],
    "published_year": "2001",
    "publisher": "Bedford/St. Martin's",
    "description": "Designed for literature-based writing courses, Text Book introduces students to the idea that literary texts and ordinary spoken and written language share many of the same features. By providing imaginative methods and unique assignments that let students work with those features in their writing, Text Book involves students in the processes of exploring literature creatively, not simply consuming and analyzing it, helping them understand literature \"from the inside out.\""
  },
  {
    "title": "Understanding Literature",
    "authors": [
      "Walter B. Kalaidjian",
      "Judith Roof",
      "Stephen Watt"
    ],
    "published_year": "2004",
    "publisher": "Wadsworth Publishing Company",
    "description": "Understanding Literature is an innovative anthology and technology package representing the next generation of literary pedagogy for introduction to literature and literature for composition courses. Built on a balanced foundation of canonical and nontraditional reading selections, this text includes discussions of the formal literary elements--and integrates relevant and accessible coverage of contemporary criticism. This unique, integrated coverage of contemporary critical approaches offers students a richer, more engaging introduction to reading critically and writing about literature."
  },
  {
    "title": "Literature, Videogames and Learning",
    "authors": [
      "Andrew Burn"
    ],
    "published_year": "2021",
    "publisher": "Routledge",
    "description": "This innovative book explores links between literature and videogames, and how designing and playing games can transform our understanding of literature. It shows how studying literature through the lens of videogames can provide new insights into narrative and creative engagement with the text. The book sets out theories of narrative aesthetics and multimodality in literature and videogames, alongside models of literacy needed for such cultural and creative engagement. It goes on to examine game adaptations of children’s literature; and a series of videogames made by students based on Beowulf and Macbeth. In each case, the book considers ways in which the original text has been transformed by the process of game design, and what fresh light this casts on the literary narrative. It also considers what kind of learning, creative production, and cultural engagement is apparent in the game designs and emphasises the importance of treating games as a narrative medium in their own right. With a unique approach to the aesthetics of narrative in literature and videogames, the book will be of great interest to researchers, academics, and post-graduate students in the fields of literature, pedagogy, and game studies."
  },
  {
    "title": "Literature to Go",
    "authors": [
      "Michael Meyer"
    ],
    "published_year": "2016",
    "publisher": "Macmillan Higher Education",
    "description": "Drawn from our best-selling anthology The Bedford Introduction to Literature, Literature to Go is a brief and inexpensive collection of stories, poems, and plays supported by the superior instruction you expect from a Michael Meyer anthology. With literature from many periods, cultures, and diverse voices, the book is also a complete guide to close reading, critical thinking, and thoughtful writing about literature. The third edition features 66 new, carefully chosen stories, poems, and plays—as well as new art throughout—continuing the anthology’s mission to present literature as a living, changing art form."
  },
  {
    "title": "A Little History of Literature",
    "authors": [
      "John Sutherland"
    ],
    "published_year": "2013",
    "publisher": "Yale University Press",
    "description": "From The Epic of Gilgamesh to Harry Potter, this rollicking romp through the world of literature reveals how writings from all over the world can transport us and help us to make sense of what it means to be human."
  },
  {
    "title": "The Routledge Introduction to American War Literature",
    "authors": [
      "Jennifer Haytock"
    ],
    "published_year": "2018",
    "publisher": "Routledge",
    "description": "War and violence have arguably been some of the strongest influences on literature, but the relation is complex: more than just a subject for story-telling, war tends to reshape literature and culture. Modern war literature necessarily engages with national ideologies, and this volume looks at the specificity of how American literature deals with the emotional, intellectual, social, political, and economic contradictions that evolve into and out of war. Raising questions about how American ideals of independence and gender affect representations of war while also considering how specifically American experiences of race and class interweave with representations of combat, this book is a rich and coherent introduction to these texts and critical debates."
  },
  {
    "title": "The Gray Book",
    "authors": [
      "Diane Welch"
    ],
    "published_year": "1998",
    "publisher": "Common Sense Press (Melrose, FL)",
    "description": ""
  },
  {
    "title": "Purple Student Activity Book",
    "authors": [
      "Debbie Strayer",
      "Susan Simpson"
    ],
    "published_year": "1998",
    "publisher": "Common Sense Press (Melrose, FL)",
    "description": "Children learn reading, grammar, vocabulary, spelling, writing, research, study skills, and more."
  },
  {
    "title": "Loving Literature",
    "authors": [
      "Deidre Lynch"
    ],
    "published_year": "2015",
    "publisher": "University of Chicago Press",
    "description": "\"Of the many charges laid against contemporary literary scholars, one of the most common--and perhaps the most wounding--is that they simply don't love books. And while the most obvious response is that, no, actually the profession of literary studies does acknowledge and address personal attachments to literature, that answer risks obscuring a more fundamental question: Why should they? That question led Deidre Shauna Lynch into the historical and cultural investigation of Loving Literature. How did it come to be that professional literary scholars are expected not just to study, but to love literature, and to inculcate that love in generations of students? What Lynch discovers is that books, and the attachments we form to them, have long played a role in the formation of private life--that the love of literature, in other words, is neither incidental to, nor inextricable from, the history of literature. Yet at the same time, there is nothing self-evident or ahistorical about our love of literature: our views of books as objects of affection have clear roots in late eighteenth-century and nineteenth-century publishing, reading habits, and domestic history.\"--Publisher's Web site."
  },
  {
    "title": "How to Read Literature",
    "authors": [
      "Terry Eagleton"
    ],
    "published_year": "2013",
    "publisher": "Yale University Press",
    "description": "DIV A literary master’s entertaining guide to reading with deeper insight, better understanding, and greater pleasure /div"
  },
  {
    "title": "The Event",
    "authors": [
      "Ilai Rowner"
    ],
    "published_year": "2015",
    "publisher": "U of Nebraska Press",
    "description": "What is an event? From a philosophical perspective, events are irregular occurrences—moments of change and interruption—categorized by human perception, language, and thought. While philosophers have pored over the subject of events extensively in recent years, The Event: Literature and Theory seeks to ground it: What is literature’s approach to the event? How does literature produce and give testimony to events? Ilai Rowner’s study not only revisits some of the most important thinkers of our time, including Maurice Blanchot, Gilles Deleuze, Jacques Derrida, and Martin Heidegger, it also develops a critical approach to literature that questions the meaning of the literary event through examinations of literary works by Marcel Proust, Louis-Ferdinand Céline, and T. S. Eliot. Rowner offers a new method of thinking about the particular characteristics of the event within literary works and defines the creative value of literature as the aspiration toward the un-happening within the happening. In this study the experience of literature—as an act of both writing and reading—becomes the struggle to capture the excessive movement of the event while also revealing the creative energy within that work of literature."
  },
  {
    "title": "Literature Against Criticism",
    "authors": [
      "Martin Paul Eve"
    ],
    "published_year": "2016",
    "publisher": "Open Book Publishers",
    "description": "This is a book about the power game currently being played out between two symbiotic cultural institutions: the university and the novel. As the number of hyper-knowledgeable literary fans grows, students and researchers in English departments waver between dismissing and harnessing voices outside the academy. Meanwhile, the role that the university plays in contemporary literary fiction is becoming increasingly complex and metafictional, moving far beyond the ‘campus novel’ of the mid-twentieth century. Martin Paul Eve’s engaging and far-reaching study explores the novel's contribution to the ongoing displacement of cultural authority away from university English. Spanning the works of Jennifer Egan, Ishmael Reed, Tom McCarthy, Sarah Waters, Percival Everett, Roberto Bolaño and many others, Literature Against Criticism forces us to re-think our previous notions about the relationship between those who write literary fiction and those who critique it."
  },
  {
    "title": "Field of Schemes",
    "authors": [
      "Neil deMause",
      "Joanna Cagan"
    ],
    "published_year": "2015",
    "publisher": "U of Nebraska Press",
    "description": ""
  },
  {
    "title": "The Penguin Book of Migration Literature",
    "authors": [
      "Dohra Ahmad"
    ],
    "published_year": "2019",
    "publisher": "National Geographic Books",
    "description": "[Ahmad's] \"introduction is fiery and charismatic... This book encompasses the diversity of experience, with beautiful variations and stories that bicker back and forth.\" --Parul Sehgal, The New York Times The first global anthology of migration literature featuring works by Mohsin Hamid, Zadie Smith, Marjane Satrapi, Salman Rushdie, and Warsan Shire, with a foreword by Edwidge Danticat, author of Everything Inside A Penguin Classic Every year, three to four million people move to a new country. From war refugees to corporate expats, migrants constantly reshape their places of origin and arrival. This selection of works collected together for the first time brings together the most compelling literary depictions of migration. Organized in four parts (Departures, Arrivals, Generations, and Returns), The Penguin Book of Migration Literature conveys the intricacy of worldwide migration patterns, the diversity of immigrant experiences, and the commonalities among many of those diverse experiences. Ranging widely across the eighteenth through twenty-first centuries, across every continent of the earth, and across multiple literary genres, the anthology gives readers an understanding of our rapidly changing world, through the eyes of those at the center of that change. With thirty carefully selected poems, short stories, and excerpts spanning three hundred years and twenty-five countries, the collection brings together luminaries, emerging writers, and others who have earned a wide following in their home countries but have been less recognized in the Anglophone world. Editor of the volume Dohra Ahmad provides a contextual introduction, notes, and suggestions for further exploration."
  },
  {
    "title": "Readings at the Edge of Literature",
    "authors": [
      "Myra Jehlen"
    ],
    "published_year": "2002",
    "publisher": "University of Chicago Press",
    "description": "Myra Jehlen's aim in these essays is to read for what she calls the edge of literature: the point at which writing seems unable to say more, which is also, for Jehlen, the threshold of the real. It is here, she argues, that the central paradoxes of the American project become clear—self-reliance and responsibility, universal equality and the pursuit of empire, writing from the heart and representing shared values and ideas. Developing these paradoxes to their utmost tension, American writers often produce penetrating critiques of American society without puncturing its basic myths. For instance, Mark Twain's Puddn'head Wilson begins as a slashing satire of racism, only to conclude by demonstrating that even an invisible portion of black blood can make a man a murderer. Throughout these essays Jehlen demonstrates the crucial role that the process of writing itself plays in unfolding these paradoxes, whether in the form of novels by Harriet Beecher Stowe and Virginia Woolf; the histories of Captain John Smith; or even a work of architecture, such as the Guggenheim museum in Bilbao."
  },
  {
    "title": "On Lingering and Literature",
    "authors": [
      "Harold Schweizer"
    ],
    "published_year": "2021",
    "publisher": "Routledge",
    "description": "Lingering and its decried equivalents, such as dawdling, idling, loafing, or lolling about, are both shunned and coveted in our culture where time is money and where there is never quite enough of either. Is lingering lazy? Is it childish? Boring? Do poets linger? (Is that why poetry is boring?) Is it therapeutic? Should we linger more? Less? What happens when we linger? Harold Schweizer here examines an experience of time that, though common, usually passes unnoticed. Drawing on a wide range of philosophic and literary texts and examples, On Lingering and Literature exemplifies in its style and accessible argumentation the new genre of post-criticism, and aims to reward anyone interested in slow reading, daydreaming, or resisting our culture of speed and consumption."
  },
  {
    "title": "The Catcher in the Rye",
    "authors": [
      "J. D. Salinger"
    ],
    "published_year": "2024",
    "publisher": "ببلومانيا للنشر والتوزيع",
    "description": "The Catcher in the Rye,&quot; written by J.D. Salinger and published in 1951, is a classic American novel that explores the themes of adolescence, alienation, and identity through the eyes of its protagonist, Holden Caulfield. The novel is set in the 1950s and follows Holden, a 16-year-old who has just been expelled from his prep school, Pencey Prep. Disillusioned with the world around him, Holden decides to leave Pencey early and spend a few days alone in New York City before returning home. Over the course of these days, Holden interacts with various people, including old friends, a former teacher, and strangers, all the while grappling with his feelings of loneliness and dissatisfaction. Holden is deeply troubled by the &quot;phoniness&quot; of the adult world and is haunted by the death of his younger brother, Allie, which has left a lasting impact on him. He fantasizes about being &quot;the catcher in the rye,&quot; a guardian who saves children from losing their innocence by catching them before they fall off a cliff into adulthooda. The novel ends with Holden in a mental institution, where he is being treated for a nervous breakdown. He expresses some hope for the future, indicating a possible path to recovery.."
  },
  {
    "title": "A Father's Promise",
    "authors": [
      "Donna L. Hess"
    ],
    "published_year": "1987",
    "publisher": "Journeyforth",
    "description": "\"Designed for use with Reading for Christian schools 6 and for the reading enjoyment of children of comparable ages.\""
  },
  {
    "title": "What Happens in Literature",
    "authors": [
      "Edward W. Rosenheim"
    ],
    "published_year": "2000",
    "publisher": "University of Chicago Press",
    "description": "How can we become good readers? In this classic handbook, Edward W. Rosenheim lays out the basics that can help us all become sharper, more proficient readers. Looking at specific poems, novels, and plays, this excellent critical guide raises questions and offers suggestions designed to make us think more and enjoy more fully what we are reading. Designed for students of literature as well as those who simply like to read, What Happens in Literature helps readers appreciate literary works as unique creations, born in a particular time and place, but powerful enough to speak across centuries."
  },
  {
    "title": "Scarlet Stockings",
    "authors": [
      "Louisa May Alcott"
    ],
    "published_year": "2022",
    "publisher": "DigiCat",
    "description": "This is a collection of short stories all written by the author most well-known for her novel, \"Little Women\". Many of the characters are similar to those created for Little Women and Alcott's subsequent novels, and in some senses could be considered refections of her troubled childhood."
  },
  {
    "title": "World Literature in Motion",
    "authors": [
      "Flair Donglai Shi",
      "Gareth Guanming Tan"
    ],
    "published_year": "2018",
    "publisher": "Ibidem Press",
    "description": "By bringing in different degrees of circulation in different regions and languages, this collection shows that while literary centers do exist in what Pascale Casanova calls \"the international literary space,\" their power does not operate unilaterally and modes of intercultural circulation do exist beyond their control. The title World Literature in Motion highlights the fact that world literature is always already the product of certain modes of conceptual and material mobility and mediation."
  },
  {
    "title": "Making Literature Now",
    "authors": [
      "Amy Hungerford"
    ],
    "published_year": "2016",
    "publisher": "Stanford University Press",
    "description": "How does new writing emerge and find readers today? Why does one writer's work become famous while another's remains invisible? Making Literature Now tells the stories of the creators, editors, readers, and critics who make their living by making literature itself come alive. The book shows how various conditions—including gender, education, business dynamics, social networks, money, and the forces of literary tradition—affect the things we can choose, or refuse, to read. Amy Hungerford focuses her discussion on literary bestsellers as well as little-known traditional and digital literature from smaller presses, such as McSweeney's. She deftly matches the particular human stories of the makers with the impersonal structures through which literary reputation is made. Ranging from fine-grained ethnography to polemical argument, this book transforms our sense of how and why new literature appears—and disappears—in contemporary American culture."
  },
  {
    "title": "Aunt Phillis's Cabin; Or, Southern Life As It Is",
    "authors": [
      "Mary H. Eastman"
    ],
    "published_year": "2022",
    "publisher": "DigiCat",
    "description": "This book is a plantation fiction novel. It was a strong commercial success and bestseller. Based on her growing up in Warrenton, Virginia, of an elite planter family, Eastman portrays plantation owners and slaves as mutually respectful, kind, and happy beings."
  },
  {
    "title": "The Child in British Literature",
    "authors": [
      "A. Gavin"
    ],
    "published_year": "2012",
    "publisher": "Springer",
    "description": "The first volume to consider childhood over eight centuries of British writing, this book traces the literary child from medieval to contemporary texts. Written by international experts, the volume's essays challenge earlier readings of childhood and offer fascinating contributions to the current upsurge of interest in constructions of childhood."
  },
  {
    "title": "The History Book",
    "authors": [
      "DK"
    ],
    "published_year": "2016",
    "publisher": "Penguin",
    "description": "Learn about the origins of our species and all things revolution in The History Book. Part of the fascinating Big Ideas series, this book tackles tricky topics and themes in a simple and easy to follow format. Learn about History in this overview guide to the subject, great for novices looking to find out more and experts wishing to refresh their knowledge alike! The History Book brings a fresh and vibrant take on the topic through eye-catching graphics and diagrams to immerse yourself in. This captivating book will broaden your understanding of History, with: - Easy to navigate step-by-step summaries that explain each historical theme - Packed with facts, charts, timelines and graphs to help explain core concepts - A visual approach to big subjects with striking illustrations and graphics throughout - Easy to follow text makes topics accessible for people at any level of understanding The History Book is a captivating introduction to the key events that have shaped society, from the dawn of civilization to the modern culture of today. Here you’ll discover the stories of important historical events and turning points, and the leaders, thinkers, and heroes involved, through exciting text and bold graphics. Your History Questions, Simply Explained This book will outline big ideas, themes and events of world history, from the founding of Baghdad and the colonization of the Americas, to the inception of Buddhism. If you thought it was difficult to learn about the milestones that have shaped civilization, The History Book presents key information in an easy to follow layout. Here you’ll learn about early humans, the empires of ancient history, the voyages of discovery to the tumultuous birth of nationalism, and the violence of two world wars. The Big Ideas Series With millions of copies sold worldwide, The History Book is part of the award-winning Big Ideas series from DK. The series uses striking graphics along with engaging writing, making big topics easy to understand."
  },
  {
    "title": "National Geographic History Book",
    "authors": [
      "Marcus Cowper"
    ],
    "published_year": "2011",
    "publisher": "National Geographic Books",
    "description": "A chronological journey through world history from the beginnings of man becomes interactive with reproductions of historical documents, including pages from the Gutenberg Bible, William Shakespeare's will, and blueprints for the Titanic."
  },
  {
    "title": "Big Book of History",
    "authors": [
      "Laura Welch"
    ],
    "published_year": "2011",
    "publisher": "New Leaf Publishing Group",
    "description": "BIG BOOK OF HISTORY Learning Just Became BIG FUN! Families, schools, and churches can unfold 15 feet of the most interesting history of the world. This easy to follow, color-coded, multi-stream timeline teaches six thousand years of world history to children ages seven through thirteen. These exciting facts and so much more wait inside: who were the first emperors of China and Rome what discovery unlocked the secrets of a forgotten language how modern robotics had its roots in the tea dolls of Japan where Christians faced death for the entertainment of thousands why the languages of Greek and Hebrew were used to write the Bible and how the Age of Discovery meant wealth some, and the destruction of civilization for others. Understanding how the past has shaped our future will inspire young learners to make history for themselves!"
  },
  {
    "title": "An Introduction to Book History",
    "authors": [
      "David Finkelstein",
      "Alistair McCleery"
    ],
    "published_year": "2006",
    "publisher": "Routledge",
    "description": "This is a comprehensive introduction to books and print culture which examines the move from the spoken word to written texts, the book as commodity, the power and profile of readers, and the future of the book in an electronic age."
  },
  {
    "title": "The Complete Book of United States History",
    "authors": [
      "Vincent Douglas",
      "School Specialty Publishing"
    ],
    "published_year": "2001",
    "publisher": "School Specialty Publishing",
    "description": "The Complete Book of United States History provides 352 pages of fun exercises for students in grades 3 to 5 that teaches important lessons in U.S. History! The exercises cover pre-United States history with the native peoples of the American continent to present day, and it also includes a complete answer key, user-friendly activities, and easy-to-follow instructions. --Over 4 million in print! Designed by leading experts, books in the Complete Book series help children in grades preschool-6 build a solid foundation in key subject areas for learning succss. Complete Books are the most thorough and comprehensive learning guides available, offering high-interest lessons to encourage learning and fun, full-color illustrations to spark interest. Each book also features challenging concepts and activities to movtivate independent study, and a complete answer key to measure performance and guide instruction."
  },
  {
    "title": "History of Shit",
    "authors": [
      "Dominique Laporte"
    ],
    "published_year": "2002",
    "publisher": "MIT Press",
    "description": "\"A brilliant account of the politics of shit. It will leave you speechless.\" Written in Paris after the heady days of student revolt in May 1968 and before the devastation of the AIDS epidemic, History of Shit is emblematic of a wild and adventurous strain of 1970s' theoretical writing that attempted to marry theory, politics, sexuality, pleasure, experimentation, and humor. Radically redefining dialectical thought and post-Marxist politics, it takes an important—and irreverent—position alongside the works of such postmodern thinkers as Foucault, Deleuze, Guattari, and Lyotard. Laporte's eccentric style and ironic sensibility combine in an inquiry that is provocative, humorous, and intellectually exhilarating. Debunking all humanist mythology about the grandeur of civilization, History of Shit suggests instead that the management of human waste is crucial to our identities as modern individuals—including the organization of the city, the rise of the nation-state, the development of capitalism, and the mandate for clean and proper language. Far from rising above the muck, Laporte argues, we are thoroughly mired in it, particularly when we appear our most clean and hygienic. Laporte's style of writing is itself an attack on our desire for \"clean language.\" Littered with lengthy quotations and obscure allusions, and adamantly refusing to follow a linear argument, History of Shit breaks the rules and challenges the conventions of \"proper\" academic discourse."
  },
  {
    "title": "Search History",
    "authors": [
      "Eugene Lim"
    ],
    "published_year": "2021",
    "publisher": "Coffee House Press",
    "description": "Search History oscillates between a wild cyberdog chase and lunch-date monologues as Eugene Lim deconstructs grieving and storytelling with uncanny juxtapositions and subversive satire. Frank Exit is dead—or is he? While eavesdropping on two women discussing a dog-sitting gig over lunch, a bereft friend comes to a shocking realization: Frank has been reincarnated as a dog! This epiphany launches a series of adventures—interlaced with digressions about AI-generated fiction, virtual reality, Asian American identity in the arts, and lost parents—as an unlikely cast of accomplices and enemies pursues the mysterious canine. In elliptical, propulsive prose, Search History plumbs the depths of personal and collective consciousness, questioning what we consume, how we grieve, and the stories we tell ourselves."
  },
  {
    "title": "The American College and University",
    "authors": [
      "Frederick Rudolph"
    ],
    "published_year": "1990",
    "publisher": "University of Georgia Press",
    "description": "First published in 1962, Frederick Rudolph's groundbreaking study, The American College and University, remains one of the most useful and significant works on the history of higher education in America. Bridging the chasm between educational and social history, this book was one of the first to examine developments in higher education in the context of the social, economic, and political forces that were shaping the nation at large. Surveying higher education from the colonial era through the mid-twentieth century, Rudolph explores a multitude of issues from the financing of institutions and the development of curriculum to the education of women and blacks, the rise of college athletics, and the complexities of student life. In his foreword to this new edition, John Thelin assesses the impact that Rudolph's work has had on higher education studies. The new edition also includes a bibliographic essay by Thelin covering significant works in the field that have appeared since the publication of the first edition. At a time when our educational system as a whole is under intense scrutiny, Rudolph's seminal work offers an important historical perspective on the development of higher education in the United States."
  },
  {
    "title": "Witness to History",
    "authors": [
      "Rut Likhṭenshṭain"
    ],
    "published_year": "2010",
    "publisher": "Gefen Books",
    "description": "Witness to History, a comprehensive book on the Holocaust aimed at both laymen and Jewish high school and college students, is unique in that it is a fully sourced, academically reliable history of the Holocaust, with particular emphasis on the experiences of religious Jews."
  },
  {
    "title": "The Complete Book of World History",
    "authors": [
      "School Specialty Publishing",
      "Vincent Douglas"
    ],
    "published_year": "2001",
    "publisher": "Carson-Dellosa Publishing",
    "description": "A comprehensive history of our world, from the dawn of human history to the present day."
  },
  {
    "title": "The Little Book of History",
    "authors": [
      "DK"
    ],
    "published_year": "2021",
    "publisher": "Penguin",
    "description": "Journey through time and explore more than 60 of the most important events in world history! See the past come to life in the most spectacular way! From the beginning of civilization to the modern world, discover the perfect pocket-sized introduction to human history. Inside the pages of this visual reference book, you’ll find: • Bold illustrations and infographics that bring complex historical events to life • Clear, authoritative text that explains the underlying causes behind historical events, and how the events unfolded • A lightweight, compact format that makes it ideal for vacation reading • Entries that are truly international in scope Human history in your pocket From the birth of Athenian democracy to the launch of Sputnik and the Global Financial Crisis, this informative little book provides you with an overview of the most fascinating events in history that shaped our world as we know it! Get to know some of the most important thinkers and leaders throughout history such as Napoleon, Julius Caesar, and Nelson Mandela. Packed with infographics and flowcharts that explain complex concepts in a simple but exciting way, The Little Book of History is a modern twist on the good old-fashioned encyclopedia. It’s perfect for holidaymakers looking to go beyond the standard beach read. Even more Little Books to discover The Little Book of History series uses a combination of creative typography, bold infographics, and clear text to explore every area of a subject. For the perfect introduction to politics and political thought throughout history, look out for The Little Book of Politics. More titles in this series include The Little Book of Economics and The Little Book of Philosophy."
  },
  {
    "title": "The Broadview Introduction to Book History",
    "authors": [
      "Michelle Levy",
      "Tom Mole"
    ],
    "published_year": "2017",
    "publisher": "Broadview Press",
    "description": "Book history has emerged in the last twenty years as one of the most important new fields of interdisciplinary study. It has produced new interpretations of major historical events, has made possible new approaches to history, literature, media, and culture, and presents a distinctive historical perspective on current debates about the future of the book. The Broadview Introduction to Book History provides the most comprehensive and up-to-date introduction to this field. Written in a lively, accessible style, chapters on materiality, textuality, printing and reading, intermediality, and remediation guide readers through numerous key concepts, illustrated with examples from literary texts and historical documents produced across a wide historical range. An ideal text for undergraduate and graduate courses in book history, it offers a road map to this dynamic inter-disciplinary field."
  },
  {
    "title": "What is the History of the Book?",
    "authors": [
      "James Raven"
    ],
    "published_year": "2018",
    "publisher": "John Wiley & Sons",
    "description": "James Raven, a leading historian of the book, offers a fresh and accessible guide to the global study of the production, dissemination and reception of written and printed texts across all societies and in all ages. Students, teachers, researchers and general readers will benefit from the book's investigation of the subject's origins, scope and future direction. Based on original research and a wide range of sources, What is the History of the Book? shows how book history crosses disciplinary boundaries and intersects with literary, historical, media, library, conservation and communications studies. Raven uses examples from around the world to explore different traditions in bibliography, palaeography and manuscript studies. He analyses book history's growing global ambition and demonstrates how the study of reading practices opens up new horizons in social history and the history of knowledge. He shows how book history is contributing to debates about intellectual and popular culture, colonialism and the communication of ideas. The first global, accessible introduction to the field of book history from ancient to modern times, What is the History of the Book? is essential reading for all those interested in one of society's most important cultural artefacts."
  },
  {
    "title": "A Companion to the History of the Book",
    "authors": [
      "Simon Eliot",
      "Jonathan Rose"
    ],
    "published_year": "2011",
    "publisher": "John Wiley & Sons",
    "description": "A COMPANION TO THE HISTORY OF THE BOOK A COMPANION TO THE HISTORY OF THE BOOK Edited by Simon Eliot and Jonathan Rose “As a stimulating overview of the multidimensional present state of the field, the Companion has no peer.” Choice “If you want to understand how cultures come into being, endure, and change, then you need to come to terms with the rich and often surprising history Of the book ... Eliot and Rose have done a fine job. Their volume can be heartily recommended. “ Adrian Johns, Technology and Culture From the early Sumerian clay tablet through to the emergence of the electronic text, this Companion provides a continuous and coherent account of the history of the book. A team of expert contributors draws on the latest research in order to offer a cogent, transcontinental narrative. Many of them use illustrative examples and case studies of well-known texts, conveying the excitement surrounding this rapidly developing field. The Companion is organized around four distinct approaches to the history of the book. First, it introduces the variety of methods used by book historians and allied specialists, from the long-established discipline of bibliography to newer IT-based approaches. Next, it provides a broad chronological survey of the forms and content of texts. The third section situates the book in the context of text culture as a whole, while the final section addresses broader issues, such as literacy, copyright, and the future of the book. Contributors to this volume: Michael Albin, Martin Andrews, Rob Banham, Megan L Benton, Michelle P. Brown, Marie-Frangoise Cachin, Hortensia Calvo, Charles Chadwyck-Healey, M. T. Clanchy, Stephen Colclough, Patricia Crain, J. S. Edgren, Simon Eliot, John Feather, David Finkelstein, David Greetham, Robert A. Gross, Deana Heath, Lotte Hellinga, T. H. Howard-Hill, Peter Kornicki, Beth Luey, Paul Luna, Russell L. Martin Ill, Jean-Yves Mollier, Angus Phillips, Eleanor Robson, Cornelia Roemer, Jonathan Rose, Emile G. L Schrijver, David J. Shaw, Graham Shaw, Claire Squires, Rietje van Vliet, James Wald, Rowan Watson, Alexis Weedon, Adriaan van der Weel, Wayne A. Wiegand, Eva Hemmungs Wirtén."
  },
  {
    "title": "The Mortal Sea",
    "authors": [
      "W. Jeffrey Bolster"
    ],
    "published_year": "2012",
    "publisher": "Harvard University Press",
    "description": "Since the Viking ascendancy in the Middle Ages, the Atlantic has shaped the lives of people who depend upon it for survival. And just as surely, people have shaped the Atlantic. In his innovative account of this interdependency, W. Jeffrey Bolster, a historian and professional seafarer, takes us through a millennium-long environmental history of our impact on one of the largest ecosystems in the world. While overfishing is often thought of as a contemporary problem, Bolster reveals that humans were transforming the sea long before factory trawlers turned fishing from a handliner's art into an industrial enterprise. The western Atlantic's legendary fishing banks, stretching from Cape Cod to Newfoundland, have attracted fishermen for more than five hundred years. Bolster follows the effects of this siren's song from its medieval European origins to the advent of industrialized fishing in American waters at the beginning of the twentieth century. Blending marine biology, ecological insight, and a remarkable cast of characters, from notable explorers to scientists to an army of unknown fishermen, Bolster tells a story that is both ecological and human: the prelude to an environmental disaster. Over generations, harvesters created a quiet catastrophe as the sea could no longer renew itself. Bolster writes in the hope that the intimate relationship humans have long had with the ocean, and the species that live within it, can be restored for future generations."
  },
  {
    "title": "Yesterday Is History",
    "authors": [
      "Kosoko Jackson"
    ],
    "published_year": "2021",
    "publisher": "Sourcebooks, Inc.",
    "description": "One of PopSugar's Best New YA Novels of 2021 A Buzzfeed Top LGBTQ+ YA Book A Lambda Literary YA Book to Add to Your TBR Pile A Goodreads Pride Month Pick An epic, heartfelt romance about a boy torn between two loves, one in his present ... and one in the past. A story of Black queer history, love, loss, and learning to stay in the moment before it passes you by. Weeks ago, Andre Cobb received a much-needed liver transplant. He's ready for his life to finally begin, until one night, when he passes out and wakes up somewhere totally unexpected...in 1969, where he connects with a magnetic boy named Michael. And then, just as suddenly as he arrived, he slips back to present-day Boston, where the family of his donor is waiting to explain that his new liver came with a side effect—the ability to time travel. And they've tasked their youngest son, Blake, with teaching Andre how to use his unexpected new gift. Andre splits his time bouncing between the past and future. Between Michael and Blake. Michael is everything Andre wishes he could be, and Blake, still reeling from the death of his brother, Andre's donor, keeps him at arm's length despite their obvious attraction to each other. Torn between two boys, one in the past and one in the present, Andre has to figure out where he belongs—and more importantly who he wants to be—before the consequences of jumping in time catch up to him and change his future for good. \"Fast-paced, fun, and perfect.\"—Laurie Halse Anderson, NYT bestselling author of Speak \"This book was absolutely incredible.\"—Creya, Goodreads reviewer \"Tears, man. So. Many. Tears.\"—Marci, Goodreads reviewer \"Oh my goodness. This book y'all. I'm a mess.\"—Netgalley reviewer * A Junior Library Guild Selection! \"A stellar novel that today's teens needed yesterday.\"—Booklist, STARRED review \"Charming and captivating.\"—Phil Stamper, bestselling author of The Gravity of Us \"A clever and honestly brilliant novel.\"—Julian Winters, award-winning author of Running With Lions \"A skillful and engrossing time-travel adventure.\"—Kirkus Reviews \"Compelling and memorable...[a] gem of a novel.\"—The Bulletin of the Center for Children's Books \"In his YA debut, Jackson has a great gimmick as well as a likeable protagonist who faces sociocultural realities across time.\"—Publishers Weekly"
  },
  {
    "title": "Why Learn History (When It’s Already on Your Phone)",
    "authors": [
      "Sam Wineburg"
    ],
    "published_year": "2018",
    "publisher": "University of Chicago Press",
    "description": "A look at how to teach history in the age of easily accessible—but not always reliable—information. Let’s start with two truths about our era that are so inescapable as to have become clichés: We are surrounded by more readily available information than ever before. And a huge percent of it is inaccurate. Some of the bad info is well-meaning but ignorant. Some of it is deliberately deceptive. All of it is pernicious. With the Internet at our fingertips, what’s a teacher of history to do? In Why Learn History (When It’s Already on Your Phone), professor Sam Wineburg has the answers, beginning with this: We can’t stick to the same old read-the-chapter-answer-the-question snoozefest. If we want to educate citizens who can separate fact from fake, we have to equip them with new tools. Historical thinking, Wineburg shows, has nothing to do with the ability to memorize facts. Instead, it’s an orientation to the world that cultivates reasoned skepticism and counters our tendency to confirm our biases. Wineburg lays out a mine-filled landscape, but one that with care, attention, and awareness, we can learn to navigate. The future of the past may rest on our screens. But its fate rests in our hands. Praise for Why Learn History (When It’s Already on Your Phone) “If every K-12 teacher of history and social studies read just three chapters of this book—”Crazy for History,” “Changing History . . . One Classroom at a Time,” and “Why Google Can’t Save Us” —the ensuing transformation of our populace would save our democracy.” —James W. Lowen, author of Lies My Teacher Told Me and Teaching What Really Happened “A sobering and urgent report from the leading expert on how American history is taught in the nation’s schools. . . . A bracing, edifying, and vital book.” —Jill Lepore, New Yorker staff writer and author of These Truths “Wineburg is a true innovator who has thought more deeply about the relevance of history to the Internet—and vice versa—than any other scholar I know. Anyone interested in the uses and abuses of history today has a duty to read this book.” —Niall Ferguson, senior fellow, Hoover Institution, and author of The Ascent of Money and Civilization"
  },
  {
    "title": "Reckoning with History",
    "authors": [
      "Jim Downs",
      "Erica Armstrong Dunbar",
      "T. K. Hunter",
      "Timothy Patrick McCarthy"
    ],
    "published_year": "2021",
    "publisher": "Columbia University Press",
    "description": "Reckoning with History brings together original essays from a diverse group of historians who consider how writing about the past can engage with the urgent issues of the present. The contributors—all former students of the distinguished Columbia University historian Eric Foner—explore the uses and politics of history through key episodes across a wide range of struggles for freedom. They shed new light on how different groups have defined and fought for freedom throughout American history, as well as the ways in which the ideal of freedom remains unrealized today. Covering a broad range of topics, these essays offer insight into how historians practice their craft in different ways and illuminate what it means to be a socially and politically engaged historian."
  },
  {
    "title": "History Is in the Land",
    "authors": [
      "T. J. Ferguson",
      "Chip Colwell"
    ],
    "published_year": "2015",
    "publisher": "University of Arizona Press",
    "description": "Arizona’s San Pedro Valley is a natural corridor through which generations of native peoples have traveled for more than 12,000 years, and today many tribes consider it to be part of their ancestral homeland. This book explores the multiple cultural meanings, historical interpretations, and cosmological values of this extraordinary region by combining archaeological and historical sources with the ethnographic perspectives of four contemporary tribes: Tohono O’odham, Hopi, Zuni, and San Carlos Apache. Previous research in the San Pedro Valley has focused on scientific archaeology and documentary history, with a conspicuous absence of indigenous voices, yet Native Americans maintain oral traditions that provide an anthropological context for interpreting the history and archaeology of the valley. The San Pedro Ethnohistory Project was designed to redress this situation by visiting archaeological sites, studying museum collections, and interviewing tribal members to collect traditional histories. The information it gathered is arrayed in this book along with archaeological and documentary data to interpret the histories of Native American occupation of the San Pedro Valley. This work provides an example of the kind of interdisciplinary and politically conscious work made possible when Native Americans and archaeologists collaborate to study the past. As a methodological case study, it clearly articulates how scholars can work with Native American stakeholders to move beyond confrontations over who “owns” the past, yielding a more nuanced, multilayered, and relevant archaeology."
  },
  {
    "title": "History Is Delicious",
    "authors": [
      "Joshua Lurie"
    ],
    "published_year": "2021",
    "publisher": "Gibbs Smith",
    "description": "\"From well-known cultures to those just being rediscovered ... [this book] explores the history of different dishes, cultural traditions, and even a few great recipes ... Discover the role cuisine plays in the fabric of unique cultures from around the world\"--"
  },
  {
    "title": "Doing Recent History",
    "authors": [
      "Claire Bond Potter",
      "Renee C. Romano"
    ],
    "published_year": "2012",
    "publisher": "University of Georgia Press",
    "description": "Recent history—the very phrase seems like an oxymoron. Yet historians have been writing accounts of the recent past since printed history acquired a modern audience, and in the last several years interest in recent topics has grown exponentially. With subjects as diverse as Walmart and disco, and personalities as disparate as Chavez and Schlafly, books about the history of our own time have become arguably the most exciting and talked-about part of the discipline. Despite this rich tradition and growing popularity, historians have engaged in little discussion about the specific methodological, political, and ethical issues related to writing about the recent past. The twelve essays in this collection explore the challenges of writing histories of recent events where visibility is inherently imperfect, hindsight and perspective are lacking, and historiography is underdeveloped. Those who write about events that have taken place since 1970 encounter exciting challenges that are both familiar and foreign to scholars of a more distant past, including suspicions that their research is not historical enough, negotiation with living witnesses who have a very strong stake in their own representation, and the task of working with new electronic sources. Contributors to this collection consider a wide range of these challenges. They question how sources like television and video games can be better utilized in historical research, explore the role and regulation of doing oral histories, consider the ethics of writing about living subjects, discuss how historians can best navigate questions of privacy and copyright law, and imagine the possibilities that new technologies offer for creating transnational and translingual research opportunities. Doing Recent History offers guidance and insight to any researcher considering tackling the not-so-distant past."
  },
  {
    "title": "All the People",
    "authors": [
      "Joy Hakim"
    ],
    "published_year": "2003",
    "publisher": "Oxford University Press, USA",
    "description": "Covers the period of American history from 1945 to 1998, from the end of World War II to the Clinton administration."
  },
  {
    "title": "History",
    "authors": [
      "Adam Hart-Davis"
    ],
    "published_year": "2012",
    "publisher": "Dk Pub",
    "description": "Chronologically traces the course of human history and civilization from prehistoric times to the present day, covering key events, people, inventions and discoveries, and ideas and beliefs."
  },
  {
    "title": "A World at Arms",
    "authors": [
      "Gerhard L. Weinberg"
    ],
    "published_year": "2005",
    "publisher": "Cambridge University Press",
    "description": "A truly global account of WWII - the war that encompassed six continents."
  },
  {
    "title": "How the Word Is Passed",
    "authors": [
      "Clint Smith"
    ],
    "published_year": "2021",
    "publisher": "Little, Brown",
    "description": "This “important and timely” (Drew Faust, Harvard Magazine) #1 New York Times bestseller examines the legacy of slavery in America—and how both history and memory continue to shape our everyday lives. Beginning in his hometown of New Orleans, Clint Smith leads the reader on an unforgettable tour of monuments and landmarks—those that are honest about the past and those that are not—that offer an intergenerational story of how slavery has been central in shaping our nation's collective history, and ourselves. It is the story of the Monticello Plantation in Virginia, the estate where Thomas Jefferson wrote letters espousing the urgent need for liberty while enslaving more than four hundred people. It is the story of the Whitney Plantation, one of the only former plantations devoted to preserving the experience of the enslaved people whose lives and work sustained it. It is the story of Angola, a former plantation-turned-maximum-security prison in Louisiana that is filled with Black men who work across the 18,000-acre land for virtually no pay. And it is the story of Blandford Cemetery, the final resting place of tens of thousands of Confederate soldiers. A deeply researched and transporting exploration of the legacy of slavery and its imprint on centuries of American history, How the Word Is Passed illustrates how some of our country's most essential stories are hidden in plain view—whether in places we might drive by on our way to work, holidays such as Juneteenth, or entire neighborhoods like downtown Manhattan, where the brutal history of the trade in enslaved men, women, and children has been deeply imprinted. Informed by scholarship and brought to life by the story of people living today, Smith's debut work of nonfiction is a landmark of reflection and insight that offers a new understanding of the hopeful role that memory and history can play in making sense of our country and how it has come to be. Winner of the National Book Critics Circle Award for Nonfiction Winner of the Stowe Prize Winner of 2022 Hillman Prize for Book Journalism A New York Times 10 Best Books of 2021"
  },
  {
    "title": "The Lessons of History",
    "authors": [
      "Will Durant",
      "Ariel Durant"
    ],
    "published_year": "2012",
    "publisher": "Simon and Schuster",
    "description": "A concise survey of the culture and civilization of mankind, The Lessons of History is the result of a lifetime of research from Pulitzer Prize–winning historians Will and Ariel Durant. With their accessible compendium of philosophy and social progress, the Durants take us on a journey through history, exploring the possibilities and limitations of humanity over time. Juxtaposing the great lives, ideas, and accomplishments with cycles of war and conquest, the Durants reveal the towering themes of history and give meaning to our own."
  },
  {
    "title": "The Limits of History",
    "authors": [
      "Constantin Fasolt"
    ],
    "published_year": "2013",
    "publisher": "University of Chicago Press",
    "description": "History casts a spell on our minds more powerful than science or religion. It does not root us in the past at all. It rather flatters us with the belief in our ability to recreate the world in our image. It is a form of self-assertion that brooks no opposition or dissent and shelters us from the experience of time. So argues Constantin Fasolt in The Limits of History, an ambitious and pathbreaking study that conquers history's power by carrying the fight into the center of its domain. Fasolt considers the work of Hermann Conring (1606-81) and Bartolus of Sassoferrato (1313/14-57), two antipodes in early modern battles over the principles of European thought and action that ended with the triumph of historical consciousness. Proceeding according to the rules of normal historical analysis—gathering evidence, putting it in context, and analyzing its meaning—Fasolt uncovers limits that no kind of history can cross. He concludes that history is a ritual designed to maintain the modern faith in the autonomy of states and individuals. God wants it, the old crusaders would have said. The truth, Fasolt insists, only begins where that illusion ends. With its probing look at the ideological underpinnings of historical practice, The Limits of History demonstrates that history presupposes highly political assumptions about free will, responsibility, and the relationship between the past and the present. A work of both intellectual history and historiography, it will prove invaluable to students of historical method, philosophy, political theory, and early modern European culture."
  },
  {
    "title": "How History Gets Things Wrong",
    "authors": [
      "Alex Rosenberg"
    ],
    "published_year": "2018",
    "publisher": "MIT Press",
    "description": "Why we learn the wrong things from narrative history, and how our love for stories is hard-wired. To understand something, you need to know its history. Right? Wrong, says Alex Rosenberg in How History Gets Things Wrong. Feeling especially well-informed after reading a book of popular history on the best-seller list? Don't. Narrative history is always, always wrong. It's not just incomplete or inaccurate but deeply wrong, as wrong as Ptolemaic astronomy. We no longer believe that the earth is the center of the universe. Why do we still believe in historical narrative? Our attachment to history as a vehicle for understanding has a long Darwinian pedigree and a genetic basis. Our love of stories is hard-wired. Neuroscience reveals that human evolution shaped a tool useful for survival into a defective theory of human nature. Stories historians tell, Rosenberg continues, are not only wrong but harmful. Israel and Palestine, for example, have dueling narratives of dispossession that prevent one side from compromising with the other. Henry Kissinger applied lessons drawn from the Congress of Vienna to American foreign policy with disastrous results. Human evolution improved primate mind reading—the ability to anticipate the behavior of others, whether predators, prey, or cooperators—to get us to the top of the African food chain. Now, however, this hard-wired capacity makes us think we can understand history—what the Kaiser was thinking in 1914, why Hitler declared war on the United States—by uncovering the narratives of what happened and why. In fact, Rosenberg argues, we will only understand history if we don't make it into a story."
  },
  {
    "title": "The Book",
    "authors": [
      "F. J. F. Suarez",
      "H. R. Woudhuysen"
    ],
    "published_year": "2013",
    "publisher": "OUP Oxford",
    "description": "A concise edition of the highly acclaimed Oxford Companion to the Book, this book features the 51 articles from the Companion plus 3 brand new chapters in one affordable volume. The 54 chapters introduce readers to the fascinating world of book history. Including 21 thematic studies on topics such as writing systems, the ancient and the medieval book, and the economics of print, as well as 33 regional and national histories of 'the book', offering a truly global survey of the book around the world, the Oxford History of the Book is the most comprehensive work of its kind. The three new articles, specially commissioned for this spin-off, cover censorship, copyright and intellectual property, and book history in the Caribbean and Bermuda. All essays are illustrated throughout with reproductions, diagrams, and examples of various typographical features. Beautifully produced and hugely informative, this is a must-have for anyone with an interest in book history and the written word."
  },
  {
    "title": "Energy and Civilization",
    "authors": [
      "Vaclav Smil"
    ],
    "published_year": "2018",
    "publisher": "MIT Press",
    "description": "A comprehensive account of how energy has shaped society throughout history, from pre-agricultural foraging societies through today's fossil fuel–driven civilization. \"I wait for new Smil books the way some people wait for the next 'Star Wars' movie. In his latest book, Energy and Civilization: A History, he goes deep and broad to explain how innovations in humans' ability to turn energy into heat, light, and motion have been a driving force behind our cultural and economic progress over the past 10,000 years. —Bill Gates, Gates Notes, Best Books of the Year Energy is the only universal currency; it is necessary for getting anything done. The conversion of energy on Earth ranges from terra-forming forces of plate tectonics to cumulative erosive effects of raindrops. Life on Earth depends on the photosynthetic conversion of solar energy into plant biomass. Humans have come to rely on many more energy flows—ranging from fossil fuels to photovoltaic generation of electricity—for their civilized existence. In this monumental history, Vaclav Smil provides a comprehensive account of how energy has shaped society, from pre-agricultural foraging societies through today's fossil fuel–driven civilization. Humans are the only species that can systematically harness energies outside their bodies, using the power of their intellect and an enormous variety of artifacts—from the simplest tools to internal combustion engines and nuclear reactors. The epochal transition to fossil fuels affected everything: agriculture, industry, transportation, weapons, communication, economics, urbanization, quality of life, politics, and the environment. Smil describes humanity's energy eras in panoramic and interdisciplinary fashion, offering readers a magisterial overview. This book is an extensively updated and expanded version of Smil's Energy in World History (1994). Smil has incorporated an enormous amount of new material, reflecting the dramatic developments in energy studies over the last two decades and his own research over that time."
  },
  {
    "title": "A People's History of the United States",
    "authors": [
      "Howard Zinn"
    ],
    "published_year": "2003",
    "publisher": "Harper Collins",
    "description": "Since its original landmark publication in 1980, A People's History of the United States has been chronicling American history from the bottom up, throwing out the official version of history taught in schools -- with its emphasis on great men in high places -- to focus on the street, the home, and the, workplace. Known for its lively, clear prose as well as its scholarly research, A People's History is the only volume to tell America's story from the point of view of -- and in the words of -- America's women, factory workers, African-Americans, Native Americans, the working poor, and immigrant laborers. As historian Howard Zinn shows, many of our country's greatest battles -- the fights for a fair wage, an eight-hour workday, child-labor laws, health and safety standards, universal suffrage, women's rights, racial equality -- were carried out at the grassroots level, against bloody resistance. Covering Christopher Columbus's arrival through President Clinton's first term, A People's History of the United States, which was nominated for the American Book Award in 1981, features insightful analysis of the most important events in our history. Revised, updated, and featuring a new after, word by the author, this special twentieth anniversary edition continues Zinn's important contribution to a complete and balanced understanding of American history."
  },
  {
    "title": "UCLA",
    "authors": [
      "Marina Dundjerski"
    ],
    "published_year": "2011",
    "publisher": "Third Millennium Publishing",
    "description": "UCLA: The First Century is an extensively illustrated hardcover book which follows a chronological historical narrative with in-depth sections on campus traditions and the history of Bruin athletics.Since the UCLA History Project was launched in 2004, UCLA have been chronicling a full account of their alma mater, from humble beginnings to their current standing as one of the world's most prestigious public research universities. The research and editorial team for this publication delved into the untold number of historical documents and photographs preserved in UCLA's archives and beyond, interviewed numerous members of the UCLA community, and searched for materials and anecdotes that were on the verge of becoming permanently lost or forgotten.'100 years of UCLA on your coffee table.' Los Angeles Times\"I wanted to create an authentic, historical account of our university. Every day I am inspired by the story of UCLA and I see its history as a collective, living legacy that we all share.\" Marina Dundjerski '94, Author'The book is indeed beautiful. Thank you so much for all the work that went into it.' Rhea Turtletaub, Vice Chancellor, UCLA External Affairs"
  },
  {
    "title": "History of the World in 1000 Objects",
    "authors": [
      "DK"
    ],
    "published_year": "2020",
    "publisher": "Penguin",
    "description": "Discover how humans created their world from the objects they left behind - from the US Constitution to the first iPhone - in DK's latest history book. From the beginning of human history, the one thing that has defined us is our talent for making things, from basic technology and everyday objects, such as bowls and hand axes, to high-tech inventions, such as supersonic aircraft, smart devices, and Mars rovers. Objects speak volumes about a civilization, telling us how our ancestors lived - as well as what they believed in and valued. A bronze cat mummy shows us how highly the ancient Egyptians valued their feline companions, while a mechanical tiger toy tells the story of rising tensions between an Indian sultan and European colonizers. With stunning, exclusive photography, History of the World in 1000 Objects shows you the objects that our ancestors treasured - from the jewelry worn by the Mesopotamians to the prized ritual vessels used by the people of the Shang Dynasty - and gives you insight into what gave each culture its own identity. From astrolabes and airplanes to vacuum cleaners and X-rays, DK uses its hallmark visual style to weave the extraordinary legacy of our creativity into a unique view of world history that will change the way you see the objects all around us."
  },
  {
    "title": "Fresh Slices",
    "authors": [
      "New York Tri-State Chapter of Sisters in Crime",
      "Terrie Farley Moran",
      "Clare Toohey",
      "Catherine Maiorisi",
      "Cynthia Benjamin",
      "Susan Chalfin",
      "Fran Cox",
      "Laura K. Curtis",
      "Eileen Dunbaugh",
      "Lois Karlin",
      "Lynne Lederman",
      "Leigh Neely",
      "Anita Page",
      "Triss Stein",
      "Cathi Stoler",
      "Anne-Marie Sutton",
      "Joan Tuohy",
      "Deirdre Verne",
      "Stephanie Wilson-Flaherty",
      "Lina Zeldovich",
      "Elizabeth Zelvin",
      "K.J.A. Wishnia"
    ],
    "published_year": "2014",
    "publisher": "Glenmere Press",
    "description": "Slices of life beyond the tourist's view. By turns funny, tough, and somber, the twenty-one helpings of New York attitude in Fresh Slices reveal neighborhoods both rich and poor, where old-timers desperately protect their secrets and brand-new arrivals indulge dangerous appetites. There is as much variety in the tones, settings, and approaches as in Gotham itself, and yet each of these crime stories also reflects the city's most infectious and unifying principle, that special combination of adaptability and assertiveness dished out more often than any pizza or street meat. In this, Fresh Slices’ second edition, urban short stories offer action-packed mystery that moves from cozy to noir. The sleuths, police officers and investigators who grapple with crime in these pages are richly drawn and engagingly authentic. Written by local members of the New York / Tri-State chapter of Sisters in Crime the anthology and edited by Agatha nominee Terrie Farley Moran, Fresh Slices is second in the Murder New York series and features tales from the most ethnically diverse and densely populated city in America."
  },
  {
    "title": "An Act of Villainy",
    "authors": [
      "Ashley Weaver"
    ],
    "published_year": "2018",
    "publisher": "Minotaur Books",
    "description": "Edgar Award-shortlisted author Ashley Weaver returns with the fifth installment in the Amory Ames mystery series. An Act of Villainy is an a gem, set in 1930s London and filled with style, banter, and twists that traditional mystery fans will positively relish. \"So you've gotten yourself involved with another murder, have you?\" Walking through London’s West End after a night at the theater, Amory Ames and her husband Milo run into wealthy investor and former actor Gerard Holloway. Holloway and his wife Georgina are old friends of theirs, and when Holloway invites them to the dress rehearsal of a new play he is directing, Amory readily accepts. However, Amory is shocked to learn that Holloway has cast his mistress, actress Flora Bell, in the lead role. Furthermore, the casual invitation is not what it seems—he admits to Amory and Milo that Flora has been receiving threatening letters, and he needs their help in finding the mysterious sender. Despite Amory’s conflicting feelings—not only does she feel loyalty to Georgina, but the disintegration of the Holloways’ perfect marriage seems to bode ill for her own sometimes delicate relationship—her curiosity gets the better of her, and she begins to make inquiries. It quickly becomes clear that each member of the cast has reason to resent Flora—and with a group so skilled in the art of deception, it isn’t easy to separate truth from illusion. When vague threats escalate, the scene is set for murder, and Amory and Milo must find the killer before the final curtain falls. Also out now in the Amory Ames mysteries: Murder at the Brightwell, Death Wears a Mask, A Most Novel Revenge, and The Essence of Malice."
  },
  {
    "title": "Union Jacked",
    "authors": [
      "Diane Vallere"
    ],
    "published_year": "2021",
    "publisher": "Polyester Press",
    "description": "National bestselling author Diane Vallere brings you British style in this humorous not-quite-cozy mystery featuring amateur sleuth Samantha Kidd! Union Jacked is the ninth funny cozy in the Samantha Kidd mystery series. If you like loyal characters, questionable cops, and stylish drama, then you’ll love Diane Vallere’s chic mystery. Can Samantha keep calm and carry on? Samantha Kidd is gobsmacked by the wins in her life. Steady job: check. Great guy: check. Inner peace: closer than she’s been in a while. But when the British invasion arrives in the form of new business owners, her checked boxes tumble. Her retail employer sells out, her coworkers go on strike, and her husband is out of the country. When a union representative is found dead outside the store, the bottom falls out. Samantha’s reluctant mentor, Detective Loncar, warns her to stay out of the investigation, but even he has something to hide. Between a cop bar, a life coach, and a blue line that's anything but thin, Samantha's teacup runneth over. It’s time for Samantha to spill some tea…or risk being royally screwed. Union Jacked is a humorous mystery set in a fictional eastern Pennsylvania town. The series has a cozy mystery vibe and features a determined and loyal amateur sleuth and a fresh-start storyline. Union Jacked is the ninth book in the Samantha Kidd mystery series and appeals to fans of the Stephanie Plum series by Janet Evanovich. For readers who like: humorous mysteries, cozy mysteries, amateur sleuths, women sleuths, mystery with humor, fashionable fiction, fashionable mysteries, friendship fiction, traditional mysteries, Pennsylvania fiction, stylish sleuths, funny mysteries, personal growth fiction, crime fiction, murder mysteries, mysteries set in Pennsylvania, fashionable mysteries, mystery with fashion, caper, caper mystery, British style, Anglophile mystery What people are saying about Samantha Kidd: \"...the book is enriched by the author's cleverly phrased prose and convincing characterization. The surprise ending will satisfy and delight many mystery fans. A diverting mystery that offers laughs and chills.\" ~Kirkus Reviews \"an impressive cozy mystery from a promising author.\" ~Mystery Tribune ​\"A really funny mystery with a chicklit feel.\" ~Susan M. Boyer, USA Today Bestselling Author of the Liz Talbot Mystery Series \"Designer Dirty Laundry shows that even the toughest crime is no match for a sleuth in fishnet stockings who knows her way around the designer department. A delightful debut.\" ~Kris Neri, Lefty Award-Nominated author of Revenge For Old Times' Sake ​\"Combining fashion and fatalities, Diane Vallere pens a winning debut mystery...a sleek and stylish read.\" ~Ellen Byerrum, National Bestselling author of the Crime of Fashion mysteries ​\"Vallere once again brings her knowledgeable fashion skills to the forefront, along with comedy, mystery, and a saucy romance. Buyer, Beware did not disappoint!\" ~Chick Lit Plus \"Fashion is always at the forefront, but never at the cost of excellent writing, humorous dialogue, or a compelling story.\" ~Kings River Life \"A captivating new mystery voice, Vallere has stitched together haute couture and murder in a stylish mystery. Dirty Laundry has never been so engrossing!\" ~Krista Davis, New York Times Bestselling Author of The Diva Runs Out of Thyme \"In Designer Dirty Laundry , author Diane Vallere stitches together a seamless mystery. Samantha Kidd is a witty heroine that you will root for as she fashions a fresh stylish start in her hometown of Ribbon, Pennsylvania.\" ~Avery Aames, Agatha Award-Winning Author of The Long Quiche Goodbye \"Samantha Kidd is an engaging amateur sleuth.\" -Mysterious Reviews \"It keeps you at the edge of your seat. I love the description of clothes in this book...if you love fashion, pick this up!\" -Los Angeles Mamma Blog \"Diane Vallere takes the reader through this cozy mystery with her signature wit and humor.\" -Mary Marks, NY Journal of Books \"Maybe your handbag holds only a phone and a wallet, but if you're Samantha Kidd, from Diane Vallere's Style & Error series, there may be something deadlier in the bag.​\"~Sheila Connolly, New York Times Bestselling Author of Murder at the Mansion For readers who like: humorous mysteries, cozy mysteries, amateur sleuths, women sleuths, mystery with humor, fashionable fiction, fashionable mysteries, friendship fiction, traditional mysteries, Pennsylvania fiction, stylish sleuths, funny mysteries, personal growth, self-help. Previously published under the series title \"Style & Error\" and \"Style in a Small Town\" mysteries. Join Diane's newsletter THE WEEKLY DIVA and never miss a new release! Sign up here: https://www.dianevallere.com/weekly-diva National bestselling author Diane Vallere writes funny and fashionable character-based mysteries. After two decades working for a top luxury retailer, she traded fashion accessories for accessories to murder. A past president of Sisters in Crime, Diane started her own detective agency at age ten and has maintained a passion for shoes, clues, and clothes ever since. Diane-Fans describe “her vintage Vallere goodness,” and say she is a “great storyteller” with “a way with creating strong female characters and intrigue” who is “a superb and very humorous writer.” Her gift of creating “spunky sleuths in fun settings” take readers to Dallas, Palm Springs, Los Angeles, Pennsylvania, and outer space. Drop in on Diane! Website: www.dianevallere.com Facebook: www.Facebook.com/dianevallereauthor Instagram: www.instagram.com/dianevallere ADDITIONAL BOOKS BY DIANE: Samantha Kidd Mysteries (funny, fashion-y mysteries with many mentions of pretzels) Designer Dirty Laundry Buyer, Beware The Brim Reaper Some Like It Haute Grand Theft Retro Pearls Gone Wild Cement Stilettos Panty Raid Union Jacked Slay Ride Tough Luxe Fahrenheit 501 Madison Night Mad for Mod Mysteries (cozy/traditional mysteries winking at Doris Day movies) Midnight Ice (Prequel) Pillow Stalk That Touch of Ink With Vics you get Eggroll The Decorator Who Knew Too Much The Pajama Frame Lover Come Hack Apprehend Me No Flowers Teacher's Threat The Kill of it All Material Witness Mysteries (cozy) Suede to Rest Crushed Velvet Silk Stalkings Costume Shop Mysteries (cozy) A Disguise to Die For Masking for Trouble Dressed to Confess Mermaid Sister Mysteries (cozy mysteries in the ocean) Tails from the Deep Murky Waters Sleeping with the Fishes Non-fiction Bonbons for your Brain"
  },
  {
    "title": "The Mystery in New York City",
    "authors": [
      "Carole Marsh"
    ],
    "published_year": "2003",
    "publisher": "Gallopade International",
    "description": "Four children see many of New York City's landmarks in their quest to solve the disappearance of the Statue of Liberty's torch."
  },
  {
    "title": "Mystery",
    "authors": [
      "Jonah Lehrer"
    ],
    "published_year": "2021",
    "publisher": "Simon and Schuster",
    "description": "Drawing on the fields of psychology, neuroscience and anthropology, a New York Times best-selling author unlocks the secrets of mystery's allure, shedding new light on everything from the formulas of our favorite detective shows to the calculated risks of the stock market."
  },
  {
    "title": "How to Write a Mystery",
    "authors": [
      "Mystery Writers of America"
    ],
    "published_year": "2022",
    "publisher": "Simon and Schuster",
    "description": "From 70 of the most successful mystery writers in the business, an invaluable guide to crafting mysteries—from character development and plot to procedurals and thrillers—“this is a writing guide that readers and writers will turn to again and again” (Booklist, starred review). Mystery Writers of America (MWA) is known for providing unparalleled resources on the craft, art, and business of storytelling, helping writers of all levels improve their skills for nearly a century. Now, this handbook helps authors navigate the ever-shifting publishing landscape—from pacing, plotting, the business side of publishing, to the current demand for diversity and inclusivity across all genres, and more. Featuring essays by a new generation of bestselling experts on various elements of the craft and shorter pieces of crowd-sourced wisdom from the MWA membership as a whole, the topics covered can be categorized as follows: —Before Writing (rules; genres; setting; character; research; etc.) —While Writing (outlining; the plot; dialogue; mood; etc.) —After Writing (agents; editors; self-pub; etc.) —Other than Novels (short stories; true crime; etc.) —Other Considerations (diverse characters; legal questions; criticism) Also included is a collection of essays from MWA published authors—including Jeffery Deaver, Tess Gerritsen, and Charlaine Harris—selected by bestselling authors Lee Child and Laurie King and arranged thematically answering, “What piece of writing advice do you wish you’d had at the beginning of your career?” “Everything you wanted to know about how to plan, draft, write, revise, publish, and market a mystery” (Kirkus Reviews), this inclusive manual provides practical, current, easily digestible advice for new and established authors alike."
  },
  {
    "title": "Ghost in Trouble",
    "authors": [
      "Carolyn Hart"
    ],
    "published_year": "2010",
    "publisher": "Harper Collins",
    "description": "A clever ghost springs into action to protect her former enemy from a slew of possible killers in this cozy mystery by an Agatha Award–winner. When Bailey Ruth Raeburn passed over into the great beyond, she was delighted to discover her sleuthing days would last an eternity. Joining Heaven’s Department of Good Intentions, she uses her unique advantages as a ghost—sometimes you see her, sometimes you don’t—to help those in need and ensure the wicked get their just deserts. However, on this latest mission, Bailey Ruth finds it more difficult than ever to keep up with her boss Wiggins’s rules for good spirit deportment. Not only is the woman she is supposed to save determined to thwart Bailey Ruth’s good intentions at every turn, she just so happens to be one of Bailey Ruth’s oldest enemies. Not that that should matter to one of Heaven’s best and brightest emissaries, but still, there is only so much a person can put up with—living or dead. But solving Bailey Ruth’s toughest case yet means managing a recalcitrant charge, a fraudulent medium, a mother's heartbreak, old passions and new, and a telltale rawhide dog bone. Heaven help her! Praise for Ghost in Trouble “Charming. . . . Bailey with her sunny Pollyanna attitude makes an irresistible cozy sleuth.” —Publishers Weekly “Delightful Bailey Ruth solves the tough case with panache.” —Kirkus Reviews"
  },
  {
    "title": "The Snatch",
    "authors": [
      "Bill Pronzini"
    ],
    "published_year": "2011",
    "publisher": "Speaking Volumes",
    "description": "The author's second novel and the first in the Nameless Detective series.In his first chronicled adventure, the Nameless detective hires on to handle the ransom payoff in a kidnapping case. Financier Louis Martinetti doesn't trust the police to deal with the man who snatched his 9-year-old son from his military prep school, nor is it clear that he trusts the members of his own household. On the appointed evening, Nameless takes a briefcase that contains $300,000 in cash to a secluded location chosen by the kidnapper. Then all hell breaks loose."
  },
  {
    "title": "Dead Spots",
    "authors": [
      "Lee Clark"
    ],
    "published_year": "2021",
    "publisher": "Cypress River Media LLC",
    "description": "Matthew was the last person to have heard from her alive... His alluring new patient with an odd ailment who was murdered. Might he have been on the scene when she was killed? Dr. Matthew Paine resents being suspected by the stoic detective who shows up in his office to question him. The young physician struggles against getting drawn into the investigation. But when he is targeted and his carefully crafted world of peaceful solitude is threatened, he determines to fight back to protect himself and those he loves. What could the killer possibly want from him? Delving into the victim's past paints a confusing picture of a trust funded party girl, an heiress, and a philanthropist. Matthew determines that she must have been some of all of that, complex but elusive. Can Matthew's analytical medical mind organize the sparse and disparate facts in a way that makes any sense at all to catch a killer before he strikes again? You’ll love Dead Spots – the first book in Lee Clark’s Matthew Paine Mystery series – because who doesn't get lost in the suspense and drama of a classic whodunit mystery? Get it now."
  },
  {
    "title": "Runaway Murder",
    "authors": [
      "Diana Orgain"
    ],
    "published_year": "2021",
    "publisher": "Diana Orgain",
    "description": "The second novel in the fun Gold Strike Mystery Series by USA Today Bestselling Author, Diana Orgain In the historic town of Golden, not everything that glitters is gold… Train aficionado, Jessica Peterson, may have found her dream job as the first female executive Chef of the Western Rails train. Problem is her ex-lover, is the Chief Conductor and he wants to turn the Summer BBQ Excursion into a Gourmet Champagne Brunch. Things turn contentious when online ticket sales double, thanks to Walter, the computer guru, and the results are in - it seems tourists are hankering for fancier feast. Just when Jessica thinks she has a handle on her temperamental ex-lover and conductor, along with the hustle and bustle of her new job… A body is found in the motorcar. It’s the computer guru, Walter. While plenty of people have motive, some of the strangers on the train carry dark secrets. The burden of getting the train back to the station before another person falls victim is on Jessica’s shoulders. Can she get everyone back safely, while figuring out whodunit?"
  },
  {
    "title": "Original Secrets",
    "authors": [
      "Shawn McGuire"
    ],
    "published_year": "2018",
    "publisher": "Brown Bag Books",
    "description": "The Northwoods village of Whispering Pines used to be a safe haven for outsiders, but after three deaths in two months, it’s become a hotbed of murder. Exhausted from being the only law enforcement official on duty, while also trying to open a bed-and-breakfast, Jayne O’Shea welcomes the escape she finds in her grandmother’s journals. Each entry gives her a deeper understanding of why her grandparents moved to the secluded spot so long ago. But as questions are answered, deeply hidden secrets are unearthed. If Jayne can put all the pieces of this puzzle together, she’ll not only learn the truth behind her grandmother’s death, she’ll catch a killer whose been wandering the village for forty years."
  },
  {
    "title": "DIY MFA",
    "authors": [
      "Gabriela Pereira"
    ],
    "published_year": "2016",
    "publisher": "Penguin",
    "description": "Get the Knowledge Without the College! You are a writer. You dream of sharing your words with the world, and you're willing to put in the hard work to achieve success. You may have even considered earning your MFA, but for whatever reason--tuition costs, the time commitment, or other responsibilities--you've never been able to do it. Or maybe you've been looking for a self-guided approach so you don't have to go back to school. This book is for you. DIY MFA is the do-it-yourself alternative to a Master of Fine Arts in creative writing. By combining the three main components of a traditional MFA--writing, reading, and community--it teaches you how to craft compelling stories, engage your readers, and publish your work. Inside you'll learn how to: • Set customized goals for writing and learning. • Generate ideas on demand. • Outline your book from beginning to end. • Breathe life into your characters. • Master point of view, voice, dialogue, and more. • Read with a \"writer's eye\" to emulate the techniques of others. • Network like a pro, get the most out of writing workshops, and submit your work successfully. Writing belongs to everyone--not only those who earn a degree. With DIY MFA, you can take charge of your writing, produce high-quality work, get published, and build a writing career."
  },
  {
    "title": "The S. P. Mystery",
    "authors": [
      "Harriet Pyne Grove"
    ],
    "published_year": "1930",
    "publisher": "Prabhat Prakashan",
    "description": ""
  },
  {
    "title": "The Charlotte Denver Small-Town Culinary Cozy Mystery Series Books 1 - 4",
    "authors": [
      "Sherri Bryan"
    ],
    "published_year": "2021",
    "publisher": "Sybden Publishing",
    "description": "What happens when small-town murder meets a big-hearted café owner? Grab a cuppa, get settled in your favourite reading spot, and get acquainted with café owner Charlotte Denver, the well-meaning, but hilariously politically-incorrect members of her small-town community, and Pippin the dog. These clean, fun, cozy mysteries have plenty of recipes to try for yourself, but no gore, graphic language, sex or violence, and no pesky cliffhangers! Plenty of laughs, amateur sleuthing, and murder await in this four-book collection, set on England's beautiful Cornish coast, in the fictional town of St. Eves. TAPAS, CARROT CAKE AND A CORPSE - BOOK 1 Small-town murder was never so calculated... When a stranger is murdered, the residents of a close-knit community close ranks as the hunt for a killer gathers pace, and it's not long before inquisitive café owner Charlotte Denver is desperate for a return to carefree, small-town life. Determined to do whatever she can to see the killer behind bars, she starts poking around in things she shouldn't... and discovers a secret that rocks the bustling coastal town to its core. FUDGE CAKE, FELONY AND A FUNERAL - BOOK 2 Grief, greed and grudges - the perfect recipe for murder... As the townspeople bid a final goodbye to a much-loved member of the community, and relatives of the deceased arrive in St. Eves, it's not long before tempers flare as they become consumed by greed, intent to get their hands on the family fortune. When a body is discovered, will Charlotte find the vital clue to the killer's identity before anyone else is bumped off? SPARE RIBS, SECRETS AND A SCANDAL - BOOK 3 Sometimes it's the people you think you know best who are keeping the biggest secrets... As Charlotte prepares to move into her new home, life couldn't be sunnier. However, when old friends return to the town, tragedy follows close behind and it's not long before she finds herself trying to clear her best friend's name as long-hidden secrets and a scandal from years gone by are revealed. In a race against time to save a loved one, Charlotte needs every one of her amateur sleuthing skills as the story reaches it shocking climax. Will she be too late to save the day? PUMPKINS, PERIL AND A PAELLA - BOOK 4 A ghost from the past resurfaces at Halloween and Charlotte soon realises they'll stop at nothing to get what they want... When a dead body is discovered during the annual St. Eves' Halloween fair, it isn't long before Charlotte finds herself up to her neck in helping to solve another murder mystery. This one, however, proves to be a little too close to home for her liking as she finds herself, and the man she loves, in danger. With clues to find, a killer to catch and a wedding to organise, Charlotte has her work cut out. Come and solve the mysteries and have a little fun along the way, with engaging characters, and a little romance. All books were written using British English spelling and terminology. Approximate no. of pages: 822 OTHER BOOKS IN THE CHARLOTTE DENVER SERIES Hamburgers, Homicide and a Honeymoon (5) Crab Cakes, Killers and a Kaftan (6) Mince Pies, Mistletoe and Murder (7) Doughnuts, Diamonds and Dead Men (8) Bread, Dead and Wed (9) Cozy murder mystery series, cozy murder mystery, cozy murder mystery books, cozy murder, cozy mystery, cozy mysteries, cozy romance mystery, amateur sleuth, female amateur sleuth, British cozy mystery, British cosy mystery, culinary cozy mystery, culinary cozy mystery series, cozy mystery with recipes, small-town mystery, lighthearted cozy mystery, happy endings, standalone cozy mystery, international cozy mystery, clean cozy mystery, cozy mystery with dog, animal cozy mystery, quirky characters, nosy old women"
  },
  {
    "title": "The Bright Silver Star",
    "authors": [
      "David Handler"
    ],
    "published_year": "2007",
    "publisher": "Minotaur Books",
    "description": "From the Edgar-Award winning author David Handler comes The Bright Silver Star, the third installment in the Berger and Mitry Mysteries Mitch Berger has been accepted at least on the surface by some of the posh families in the small enclave to which he's moved - even his open affair with the beautiful black policewoman is looked upon peaceably. But when a member of the small group of men who gather for early-morning walks is found dead, the subsequent investigation, involving both Mitch and Desiree, opens a very large container of personal evil that has no place in any society. \"With its vivid setting, quirky and unusual characters, and fast-paced plot skillfully interwoven with movie trivia, this cozy with attitude is sure to satisfy Handler's many committed fans and attract new ones.\" - Publishers Weekly"
  },
  {
    "title": "She Stopped for Death",
    "authors": [
      "Elizabeth Kane Buzzelli"
    ],
    "published_year": "2017",
    "publisher": "Crooked Lane Books",
    "description": "Jenny Weston and her mother, Dora, have been receiving strange midnight visits. Bear Falls's own elusive and highly secretive poet, Emily Sutton, has lived her life cloistered away with her sister in a house at the edge of Pewee Swamp. But now, Emily's started leaving scraps of poetry in Dora's Little Library, and Dora makes it her mission to befriend the sheltered woman. Meanwhile Zoe Zola, almost famous author, Little Person, and the Weston's quirky next-door neighbor, is hard at work on a new book, this one about the inner life of Emily Dickinson. And once again, Zoe's literary work starts making uncanny connections with the events in her own world as Emily Sutton reemerges into society. But Zoe begins to suspect things aren't anywhere near normal at Emily's swamp house or in the lives of the people she claims have abandoned her...until looking further into the poet's half-truths leads Zoe and Jenny to a horrible murder. The chaos surrounding the ensuing investigation grows even more hectic with Emily’s increasingly erratic behavior, the arrival of a young woman searching for her missing poet uncle, and yet another betrayal in Jenny's love life. And only poetry can set the truth free in Elizabeth Kane Buzzelli's charming second Little Library mystery, She Stopped for Death."
  },
  {
    "title": "The Alpine Xanadu",
    "authors": [
      "Mary Daheim"
    ],
    "published_year": "2014",
    "publisher": "Ballantine Books",
    "description": "An exhilarating installment in Mary Daheim’s beloved and long-running small-town murder mystery series set in Alpine, Washington, and featuring unforgettable newspaper editor Emma Lord Winter in the small mountain aerie of Alpine should be as quiet as new-fallen snow on the Cascades, but from the Grocery Basket to the Venison Inn, the town is humming. At the Alpine Advocate, editor Emma Lord and her staff are on deadline with a feature about the opening of RestHaven, a new rehab and mental health facility. Front Street is buzzing with gossip about Emma’s recent engagement to Sheriff Milo Dodge. And now that fool Wayne Eriks has climbed an electric pole in the middle of a storm and got himself electrocuted. Sheriff Dodge doesn’t buy the idea that Wayne’s death is an accident. But how—and, more important, why—he died is only one of the conundrums that keep the sheriff and Emma working overtime. Why is RestHaven giving Alpine so many restless nights? What to make of allegations that someone’s trying to kill the richest man in town . . . or whispers of a rash of indecent behavior at the local high school? After Vida Runkel, the Advocate’s stalwart House & Home editor, disappears into thin air, Milo and Emma suddenly have too many loose ends to solve before they can even think about tying the knot. The Alpine Xanadu features beloved characters from the series alongside some sinister new ones—not to mention a mystery that will shake Alpine to its core. Praise for Mary Daheim and her Emma Lord mysteries “Always entertaining.”—The Seattle Times “Mary Daheim writes with wit, wisdom, and a big heart. I love her books.”—Carolyn Hart “Daheim writes . . . with dry wit, a butter-smooth style, and obvious wicked enjoyment.”—The Oregonian “The characters are great, and the plots always attention-getting.”—King Features Syndicate “Even the most seasoned mystery fans are caught off-guard by [Daheim’s] clever plot twists.”—BookLoons Reviews “Witty one-liners and amusing characterizations.”—Publishers Weekly"
  },
  {
    "title": "Sleight of Hand",
    "authors": [
      "Robin Hathaway"
    ],
    "published_year": "2008",
    "publisher": "Minotaur Books",
    "description": "Dr. Jo Banks is well settled in her rather unusual life as one of the few doctors in the New Jersey fields, her office in a motor inn run by a pair of friendly, elderly Jersey-ites. But New York City is where she grew up, and there are times when she thinks back to those days with her father. One day, as she is driving home from her rounds at the hospital in the nearby town, she hears a familiar sound coming from a barn. It is the hum of an out-of-date printing press, a brand her father used. On an impulse, Jo leaves her motorcycle in the road and walks down to the barn housing the machine. But the printer is hardly welcoming. While she is trying to talk to him, he catches his hand in the press, and Jo bursts into action. Although she removes the screws from the roller that is clamping the man's fingers and offers to drive him to the hospital, he refuses to go and insists she treat him in his home. The strange episode leads to Jo's calling daily to attend to the man's injury. She learns that he's living with his daughter—a grown woman who possesses the mind of a child—that they are from New York, and that his wife has mysteriously disappeared. The printer is roughly grateful for Jo's care, but he has much on his mind, and he will not leave his house. Jo begins to suspect he is connected to a recent local murder. Robin Hathaway rewards her readers with another rich story of the lives of people who live and work in the New Jersey farmland. Sleight of Hand is a worthy addition to this finely crafted series."
  },
  {
    "title": "Death at an English Wedding",
    "authors": [
      "Sara Rosett"
    ],
    "published_year": "2017",
    "publisher": "Sara Rosett",
    "description": "Tying the knot was never so deadly . . . Wedding bells are ringing for location scouts Kate and Alex in a ceremony at one of England’s most elegant stately homes, but when a guest is murdered and suspicion falls on those closest to Kate, she and Alex must put their plans for happily ever after on hold. If they can’t figure out who sabotaged their big day, their honeymoon may be over before it begins. Death at an English Wedding is the seventh installment in the popular Murder on Location series from USA Today bestselling author Sara Rosett, which features an English village and quirky characters along with dashes of humor and romance. Indulge your inner Anglophile with Sara Rosett’s English village cozy today! MURDER ON LOCATION SERIES: Book One - Death in the English Countryside Book Two - Death in an English Cottage Book Three - Death in a Stately Home Book Four - Death in an Elegant City Book Five - Menace at the Christmas Market (Novella) Book Six - Death in an English Garden Book Seven - Death at an English Wedding Have you read Sara Rosett’s other mystery series? If you like historical mysteries with lady detectives, check out the HIGH SOCIETY LADY DETECTIVE mystery series. If you like travel with your mystery, check out the ON THE RUN INTERNATIONAL MYSTERIES."
  },
  {
    "title": "The Mystery of Three Quarters",
    "authors": [
      "Sophie Hannah"
    ],
    "published_year": "2019",
    "publisher": "William Morrow Paperbacks",
    "description": "The world’s most beloved detective, Hercule Poirot—the legendary star of Agatha Christie’s Murder on the Orient Express and most recently The Monogram Murders and Closed Casket—returns in a stylish, diabolically clever mystery set in the London of 1930. “We Agatha Christie fans read her stories--and particularly her Poirot novels--because the mysteries are invariably equal parts charming and ingenious, dark and quirky and utterly engaging. Sophie Hannah had a massive challenge in reviving the beloved Poirot, and she met it with heart and no small amount of little grey cells. I was thrilled to see the Belgian detective in such very, very good hands. Reading The Monogram Murders was like returning to a favorite room of a long-lost home.” — Gillian Flynn, author of Gone Girl Hercule Poirot returns home after an agreeable luncheon to find an angry woman waiting to berate him outside his front door. Her name is Sylvia Rule, and she demands to know why Poirot has accused her of the murder of Barnabas Pandy, a man she has neither heard of nor ever met. She is furious to be so accused, and deeply shocked. Poirot is equally shocked, because he too has never heard of any Barnabas Pandy, and he certainly did not send the letter in question. He cannot convince Sylvia Rule of his innocence, however, and she marches away in a rage. Shaken, Poirot goes inside, only to find that he has a visitor waiting for him — a man called John McCrodden who also claims also to have received a letter from Poirot that morning, accusing him of the murder of Barnabas Pandy... Poirot wonders how many more letters of this sort have been sent in his name. Who sent them, and why? More importantly, who is Barnabas Pandy, is he dead, and, if so, was he murdered? And can Poirot find out the answers without putting more lives in danger?"
  },
  {
    "title": "Murder in the Cookbook Nook",
    "authors": [
      "Ellery Adams"
    ],
    "published_year": "2021",
    "publisher": "Kensington Cozies",
    "description": "\"Virginia is for lovers--and Storyton Hall is its best vacation spot for lovers of books. The big event this summer at Jane Steward's resort is A Bookish Cook-Off. It's a blend of the literary and the culinary--but someone's headed for the mortuary...\"--Page 4 of cover."
  },
  {
    "title": "If You're Out There",
    "authors": [
      "Katy Loutzenhiser"
    ],
    "published_year": "2019",
    "publisher": "HarperCollins",
    "description": "“Funny, engrossing, and one-of-a-kind. If You’re Out There completely swept me away.” —Becky Albertalli, New York Times bestselling author of Leah on the Offbeat Part whip-smart suspense tale, part touching story of friendship, this is an extraordinary debut about a determined teen trying to solve a mystery no one else believes in. After Zan’s best friend moves to California, she is baffled and crushed when Priya suddenly ghosts. Worse, Priya’s social media has turned into a stream of ungrammatical posts chronicling a sunny, vapid new life that doesn’t sound like her at all. Everyone tells Zan not to be an idiot: Let Priya do her reinvention thing and move on. But until Zan hears Priya say it, she won’t be able to admit that their friendship is finished. It’s only when she meets Logan, the compelling new guy in Spanish class, that Zan begins to open up about her sadness, her insecurity, her sense of total betrayal. And he’s just as willing as she is to throw himself into the investigation when everyone else thinks her suspicions are crazy. Then a clue hidden in Priya’s latest selfie introduces a new, deeply disturbing possibility: Maybe Priya isn’t just not answering Zan’s emails. Maybe she can’t."
  },
  {
    "title": "Vineyard Enigma",
    "authors": [
      "Philip R. Craig"
    ],
    "published_year": "2002",
    "publisher": "Scribner Book Company",
    "description": "Bestselling author Philip R. Craig's suspenseful new Martha's Vineyard mystery brings together family, fishing, intrigue, and the international art world in a series renowned for its authenticity and charm. Includes three recipes."
  },
  {
    "title": "The P'town Murders",
    "authors": [
      "Jeffrey Round"
    ],
    "published_year": "2007",
    "publisher": "Psychology Press",
    "description": "Secret agent Brad Fairfax is summoned by a mysterious voice to come to Cape Cod to claim the body of his ex-lover and best friend. On site he discovers that Ross was murdered, the first in a string of four corpses to show up. Victims and suspects have two points in common: they are all connected to a gay guesthouse for wealthy clients where anything is permitted, and most have some connection to Buddhism. Although Brad investigates on his own, his boss at the mysterious agency for which he works feels certain the murderer is implicated in an assassination plot against the Dalai Lama, who is to speak soon in New York's Central Park. The possibility of romance comes with the appearance of a young, blue-haired Buddhist. But Brad will have to learn the meaning of trust and to overcome his irrational bouts of jealousy before there can be any hope of a real connection."
  },
  {
    "title": "Gone with the Win",
    "authors": [
      "Mary Daheim"
    ],
    "published_year": "2013",
    "publisher": "Harper Collins",
    "description": "In Gone with the Win, another charming entry in Mary Daheim’s beloved Bed-and-Breakfast series, someone from Judith McMonigle Flynn’s past comes knocking, and the reluctant amateur sleuth finds herself working a case so cold it's practically frozen. Ruby Tooms drops her bags and a mystery on the lovely Persian carpet of Hillside Manor, Judith’s bed-and-breakfast in Seattle. Ruby’s mother was strangled years before, soon after her divorce from Ruby’s father—and the killer is still at large. Undaunted, Judith agrees to help Ruby. Cousin Renie grudgingly pitches in, and even Judith’s husband, Joe, gets involved. The game’s afoot and ahoof with Judith discovering that the hand she's been dealt includes not only a joker but that deadly card, the Ace of Spades. And, she’s off…in pursuit of a killer."
  },
  {
    "title": "The Book of Mysteries",
    "authors": [
      "Jonathan Cahn"
    ],
    "published_year": "2016",
    "publisher": "Charisma Media",
    "description": "New York Times Best Seller! 1500 5-Star Reviews! From the author that brought you NEW YORK TIMES best selling books The Harbinger, The Mystery of the Shemitah, and The Paradigm selling over 3 MILLION copies Imagine if you discovered a treasure chest in which were hidden ancient mysteries, revelations from heaven, secrets of the ages, the answers to man’s most enduring, age-old questions, and the hidden keys that can transform your life to joy, success, and blessing…This is The Book of Mysteries."
  },
  {
    "title": "The Ragamuffin Mystery",
    "authors": [
      "Enid Blyton"
    ],
    "published_year": "2022",
    "publisher": "DigiCat",
    "description": "DigiCat Publishing presents to you this special edition of \"The Ragamuffin Mystery\" by Enid Blyton. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature."
  },
  {
    "title": "The Mystery of Grimly Manor",
    "authors": [
      "Donna Wren Carson"
    ],
    "published_year": "2012",
    "publisher": "Xlibris Corporation",
    "description": "Leira MacGregor is anxiously awaiting the arrival of two new families into her neighborhood. She is hoping desperately that someone will finally move in with children her own age. They may be able to help her to solve the mystery of Grimly Manor. The spooky manor, which was built long ago, has an ancient cemetery behind it. According to whisperings, there is a scary old man who lives there but no one has seen him except on Halloween. Candles flicker in the night, and on holidays, decorations appear around the manor like magic. Families in the neighborhood try and ignore these strange happenings. Over the years, children have only been able to conquer their fear on Halloween by knocking on the decaying door. When the door was opened, they were ‘greeted’ by someone in a frightful mask and costume with vicious growling in the background. It’s up to Leira to find someone brave enough to help solve the mystery. Little does she imagine what adventures lay in her path!"
  },
  {
    "title": "Twisted- A Pine Ridge Mystery",
    "authors": [
      "Don Narus"
    ],
    "published_year": "2018",
    "publisher": "Lulu.com",
    "description": "Its Saturday morning at the Royal Palms Club House, a 55 plus community in Pine County Florida. Breakfast has been served and eaten. The fifty-fifty drawing has been completed, with the women winning all the cash prizes. Some things never change. A downpour has descended on the complex preventing anyone from leaving. Six men are seated around a table as the conversation turns to telling stories, Weird stories. One more bizarre than the other. Some have been experienced by the teller, while others as told to the teller. All presumably true. These are stories that would be told before a fire on a cold stormy night, All will give you pause. None will be forgotten"
  },
  {
    "title": "Walleye Junction",
    "authors": [
      "Karin Salvalaggio"
    ],
    "published_year": "2016",
    "publisher": "Macmillan",
    "description": "When outspoken radio talk show host Philip Long is kidnapped and murdered, Detective Macy Greeley leaves her son in the care of her mother and heads up to remote Walleye Junction, Montana to take charge of the investigation. Long had been doing radio shows on the rise of far right militias in the state. After the kidnappers are found dead following a massive heroin overdose, authorities are hopeful the investigation is finished ... but there are too many discrepancies. Can Macy find who's really behind the murder?"
  },
  {
    "title": "Grave Mistake",
    "authors": [
      "Ngaio Marsh"
    ],
    "published_year": "2000",
    "publisher": "Macmillan",
    "description": "Sybil Foster of Upper Quintern is terribly proud of her gardener and of her new asparagus beds, but when her unwelcome stepson arrives, she heads for \"a chic spa for a rest cure, a liaison with the spa's director ... and an apparent suicide.\"--Cover."
  },
  {
    "title": "A Chain of Evidence",
    "authors": [
      "Carolyn Wells"
    ],
    "published_year": "2014",
    "publisher": "CreateSpace",
    "description": "Curl up with another classic locked room mystery from author Carolyn Wells. Following The Clue and The Gold Bag, A Chain of Evidence is the third book in The Fleming Stone Mysteries. A man is found murdered in a locked Manhattan apartment, the only other inhabitants of which were his niece and a servant. The niece, under suspicion, will be indicted unless Otis Landon, a young lawyer from the apartment across the hall can discover the real killer. The clues, a safety deposit key, a woman's hat pin without a head, a railroad timetable, and two music hall tickets, each point to a different person, none of whom can have committed the crime. From these clues, Landon, with the help of the noted detective, Fleming Stone, must forge the chain of evidence with which he can convict the killer and prove the innocence of the niece."
  },
  {
    "title": "The Homeplace",
    "authors": [
      "Kevin Wolf"
    ],
    "published_year": "2016",
    "publisher": "Macmillan",
    "description": "“Culled from the rarefied air of James Lee Burke, Greg Iles, and John Hart, Kevin Wolf has fashioned a painstakingly perfect tale of murder, angst, and the enduring power of the human spirit. If the late, great Pat Conroy had ever decided to write a mystery, this would be it.” —Jon Land “Kevin Wolf’s debut novel, The Homeplace, succeeds in every way. He has crafted a gripping, fast-paced narrative with beautifully drawn characters in an authentic and interesting small-town Colorado setting. Not only is the mystery compelling, but so are the characters. Even if there were no murders to solve, you would still want to spend time with these fascinating people whose lives echo the sparse and gorgeous landscape they inhabit and whose pasts refuse to leave them to their futures.” —Christine Carbo, author of The Wild Inside Chase Ford was the first of four generations of Ford men to leave Comanche County, Colorado. For Chase, leaving saved the best and hid the worst. But now, he has come home. His friends are right there waiting for him. And so are his enemies. Then the murder of a boy, a high school basketball star just like Chase, rocks the small town. When another death is discovered—one that also shares unsettling connections to him—law enforcement’s attention turns towards Chase, causing him to wonder just what he came home to. A suspenseful, dramatic crime novel, The Homeplace captures the stark beauty of life on the Colorado plains."
  },
  {
    "title": "The Mystery of Metropolisville",
    "authors": [
      "Edward Eggleston"
    ],
    "published_year": "1901",
    "publisher": "IndyPublish.com",
    "description": "Metropolisville is nothing but a memory now. If Jonah's gourd had not been a little too much used already it would serve an excellent turn just here in the way of an apt figure of speech illustrating the growth the wilting and the withering of Metropolisville."
  },
  {
    "title": "The Mystery of Marie Rogêt",
    "authors": [
      "Эдгар Аллан По"
    ],
    "published_year": "2022",
    "publisher": "Litres",
    "description": "\"The Mystery of Marie Rogêt\", often subtitled A Sequel to \"The Murders in the Rue Morgue\", is a short story by Edgar Allan Poe written in 1842. This is the first murder mystery based on the details of a real crime. It first appeared in Snowden's Ladies' Companion in three installments, November and December 1842 and February 1843."
  }
]